Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/auto.po
Languages: fr_fr

source: This plugin provides vehicles management for automobile clubs, you can manage:
fr_fr: Ce plugin fournit une gestion de véhicules pour des clubs automobiles, vous pouvez gérer :

source: vehicles (owner, several informations, photo, etc),
fr_fr: des véhicules (propriétaires, informations diverses, photo, etc),

source: vehicle history modification (owner, color, ...),
fr_fr: l'historique des modifications des véhicules (propriétaire, couleur, ...)

source: brands,
fr_fr: marques,

source: models,
fr_fr: modèles,

source: transmission types,
fr_fr: types de transmission,

source: body types,
fr_fr: types de carrosseries,

source: colors,
fr_fr: couleurs,

source: states.
fr_fr: états.

source: This plugin has been initially developed in collaboration with Anatole from `Club 404 <https://www.leclub404.com/>`_, and François from `club Fiat 500 <http://www.club500.fr/>`_. A big thanks to them for their precious help during plugin development :)
fr_fr: Ce plugin a été initialement développé en collaboration avec Anatole du `Club 404 <https://www.leclub404.com/>`_, et François du `club Fiat 500 <http://www.club500.fr/>`_. Un grand merci à eux pour leur aide précieuse durant le développement du plugin :)

source: First of all, download the plugin:
fr_fr: Tout d'abord, téléchargez le plugin :

source: Get latest Auto plugin!
fr_fr: Obtenir le dernier plugin Auto !

source: Get Auto plugin nightly build!
fr_fr: Obtenir la nightly du plugin Auto !

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
fr_fr: Extrayez l'archive téléchargée dans le dossier ``plugins`` de Galette. Par exemple, sous linux (en remplaçant `{url}` et `{version}` par les valeurs adéquates) :

source: Database initialisation
fr_fr: Initialisation de la base de données

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
fr_fr: Pour fonctionner, ce plugin requiert des tables dans la base de données. Référez-vous :ref:`à l'interface de gestion des plugins de Galette <plugins_managment>`.

source: And this is finished; Auto plugin is installed :)
fr_fr: Et c'est terminé, le plugin Auto est installé :)

source: There is no particular setup required, you can just enter data in the database.
fr_fr: Il n'y a aucune configuration requise, vous pouvez juste entrer vos données en base.

source: Configure required fields
fr_fr: Configuration des champs requis

source: When adding a new vehicle in database, there are several fields that are required, but that may not fit your needs. In such case, you can define your own required fields: just create a ``local_auto_required.inc.php`` file in your Galette ``config`` directory and declare an array of the fields you want to require. As example, if you just want to require name and model for a car, you will need:
fr_fr: Lors de l'ajout d'un nouveau véhicule en base, plusieurs champs sont requis, mais cela peut ne pas correspondre à vos besoins. Si tel est le cas, vous pouvez définir vos propres champs requis : créez simplement un fichier ``local_auto_required.inc.php`` dans le dossier ``config`` de votre Galette et déclarez-y un tableau des champs que vous voulez requérir. Par exemple, si vous souhaitez juste que les nom et modèle soient obligatoires, vous aurez :
