Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/maps.po
Languages: fr_fr

source: Maps
fr_fr: Cartes

source: This plugin provides:
fr_fr: Ce plugin fournit :

source: possibility to store geogaphical coordinates for members (latitude and longitude),
fr_fr: la possibilité d'enregistrer les coordonnées géographiques des adhérents (latitude et longitude),

source: a public map displaying up to date members that have choosen to be publically visible.
fr_fr: une carte publique pour afficher les membres à jour qui ont choisi d'être affichés publiquement.

source: First of all, download the plugin:
fr_fr: Tout d'abord, téléchargez le plugin :

source: Get latest Maps plugin!
fr_fr: Obtenir le dernier plugin Maps !

source: Get Maps plugin nightly build!
fr_fr: Obtenir la nightly du plugin Maps !

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
fr_fr: Extrayez l'archive téléchargée dans le dossier ``plugins`` de Galette. Par exemple, sous linux (en remplaçant `{url}` et `{version}` par les valeurs adéquates) :

source: Database initialisation
fr_fr: Initialisation de la base de données

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
fr_fr: Pour fonctionner, ce plugin requiert des tables dans la base de données. Référez-vous :ref:`à l'interface de gestion des plugins de Galette <plugins_managment>`.

source: And this is finished; Maps plugin is installed :)
fr_fr: Et c'est terminé, le plugin Maps est installé :)

source: Plugin usage
fr_fr: Utilisation du plugin

source: When the plugin is installed, a group `Maps` is added to Galette menu when a member is logged in, which contains `My location` entry. This page allow member to store its location.
fr_fr: Lorsque le plugin est installé, un groupe `Cartes` est ajouté au menu de Galette lorsqu'un adhérent est connecté, qui contient l'entrée `Ma localisation`. Cette page permet à l'adhérent d'enregistrer sa localisation.

source: A `Geolocalize` button is also added when displaying a member, that allows administrators to set member coordinates.
fr_fr: Un bouton `Géolocaliser` est également ajouté à l'affichage d'une fiche adhérent, qui permet aux administrateurs de définir les coordonnées de l'adhérent.

source: Also, a `Map` entry is added in public pages list, that displays geolocalized members that are up to date. Administrators and staff members will see all members, while simple members and visitors will only see up to date public ones.
fr_fr: De plus, une entrée `Carte` est ajoutée à la liste des pages publiques, qui affiche la géolocalisation des adhérents à jour. Les administrateurs et membres du bureau verront tous les adhérents, alors que les simples adhérents et les visiteurs verront uniquement ceux à jour et publics.

source: First of all, members will enter their location coordinates. Several options are provided:
fr_fr: Tout d'abord, les adhérents entreront leurs coordonnées géographiques. Plusieurs options sont fournies :

source: if town has been set in member informations, a list of possible places will be proposed (via `Nominatim online service <https://nominatim.openstreetmap.org>`_),
fr_fr: si la ville a été renseignée dans la fiche de l'adhérent, une liste des localisations possibles sera proposée (via `le service en ligne Nominatim <https://nominatim.openstreetmap.org>`_),

source: additionnaly, a search zone (provided from `OpenStreetMap <https://nominatim.openstreetmap.org/>`_),
fr_fr: en complément, une zone de recherche (fournie depuis `OpenStreetMap <https://nominatim.openstreetmap.org/>`_),

source: and also a geolocalize button using browser capacities.
fr_fr: et également une bouton de géolocalisation qui utilise les possibilités du navigateur.

source: The search zone can be used when saving members location, and when displaying the maps.
fr_fr: La zone de recherche peut être utilisée lorsque vous renseignez la localisation d'un adhérent, et aussi à l'affichage des cartes.

source: A member can define its location (with the precision he wants) on the map selecting one of the propositions:
fr_fr: Un adhérent peut définir a propre localisation (avec la précision qu'il souhaite) sur la carte en sélectionnant une des propositions :

source: Using the geolocalization button will define its position from the browser:
fr_fr: Utiliser le bouton géolocalisation déterminera sa position depuis son navigateur :

source: Then, member location is displayed on map, and can be removed:
fr_fr: Alors, la localisation de l'adhérent est affichée sur la carte, et peut être supprimée :
