Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/objectslend.po
Languages: fr_fr

source: Objects lend
fr_fr: Prêt d'objets

source: This plugin provides:
fr_fr: Ce plugin fournit :

source: objects management (description, size, lenght, price, ...)
fr_fr: gestion d'objets (description, taille, poids, prix, ...)

source: groups objects by categories,
fr_fr: regroupement d'objets par catégories,

source: manage object state, and their presence in stock or not,
fr_fr: gestion des statuts des objets, ainsi que leur présence ou non en stock,

source: manage lending and/or renting objects,
fr_fr: gestion des prêts et/ou location d'objets,

source: contribution generation,
fr_fr: génération de contributions,

source: First of all, download the plugin:
fr_fr: Tout d'abord, téléchargez le plugin :

source: Get latest ObjectsLend plugin!
fr_fr: Obtenir le dernier plugin ObjectsLend !

source: Get ObjectsLend plugin nightly build!
fr_fr: Obtenir la nightly du plugin ObjectsLend !

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
fr_fr: Extrayez l'archive téléchargée dans le dossier ``plugins`` de Galette. Par exemple, sous linux (en remplaçant `{url}` et `{version}` par les valeurs adéquates) :

source: Database initialisation
fr_fr: Initialisation de la base de données

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
fr_fr: Pour fonctionner, ce plugin requiert des tables dans la base de données. Référez-vous :ref:`à l'interface de gestion des plugins de Galette <plugins_managment>`.

source: And this is finished; ObjectsLend plugin is installed :)
fr_fr: Et c'est terminé, le plugin ObjectsLend est installé :)

source: Plugin usage
fr_fr: Utilisation du plugin

source: Once plugin has been installed, a `Object lend` group is added to Galette menu.
fr_fr: Une fois le plugin installé, un groupe `Prêt d'objets` est ajouté au menu de Galette.

source: Defaults status are provided at installation, but they can not fit your needs, you can of course define your own.
fr_fr: Des statuts par défaut sont fournis à l'installation, mais ils pourraient ne pas convenir à vos besoins, vous pourrez bien sûr définir les vôtres.

source: Define status, create categories and objects; users can lend objects with a reason, then give them back with location.
fr_fr: Définissez des statuts, créez des catégories et des objets ; les utilisateurs pourront emprunter des objets avec une raison, puis pourront les rendre avec le bouton retour et une localisation.

source: A lend history is provided for administrators and staff members from object page.
fr_fr: Un historique des prêts est fourni pour les administrateurs et membres du bureau depuis la page d'un objet.

source: Preferences
fr_fr: Préférences

source: Several preferences allows to change plugin behavior.
fr_fr: Plusieurs préférences vous permettent de modifier le comportement du plugin.

source: From this screen, you can define if members can lend objects or not, if it should create a new contribution (and its type and description), if image should be displayed in objects list, and thumbnails size.
fr_fr: Depuis cet écran, vous pourrez définir si les adhérents peuvent emprunter des objets ou non, si cela doit donner lieu à une nouvelle contribution (ainsi que son type et une description), si l'image doit être affichée dans la liste des objets et la taille des miniatures.

source: It is possible to activate the fullsize photo display.
fr_fr: Il est possible d'activer l'affichage des photos en pleine taille.

source: Photos sent with previous plugin version were always resized, only the thumbnail was stored. If you want to get fullsize display, you will have to send photos again.
fr_fr: Les photos envoyées avec une version antérieure du plugin étaient systématiquement retaillées, et seule la miniature était stockée. Si vous souhaitez utiliser l'affichage en pleine taille, vous devrez envoyer de nouveau les photos.
