Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/paypal.po
Languages: fr_fr

source: This plugin provides:
fr_fr: Ce plugin fournit :

source: possibility to associate an amount to a contribution type,
fr_fr: la possibilité d'associer un montant à un type de contribution,

source: create a Paypal payment form,
fr_fr: la création d'un formulaire de paiement,

source: an history,
fr_fr: un historique,

source: automatic transaction storage once validated.
fr_fr: le stockage des transactions une fois validées.

source: Paypal plugin preferences
fr_fr: Préférences du plugin Paypal

source: Paypal payment form
fr_fr: Formulaire de paiement Paypal

source: Paypal payment form (public)
fr_fr: Formulaire de paiement Paypal (public)

source: Due to the way Paypal payments are handled, especially the payment confirmation, your instance must be publically accessible.
fr_fr: En raison de la façon dont les paiements Paypal sont gérés, notamment la confirmation de paiement, votre instance devra être accessible publiquement.

source: First of all, download the plugin:
fr_fr: Tout d'abord, téléchargez le plugin :

source: Get latest Paypal plugin!
fr_fr: Obtenir le dernier plugin Paypal !

source: Get Paypal plugin nightly build!
fr_fr: Obtenir la nightly du plugin Paypal !

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
fr_fr: Extrayez l'archive téléchargée dans le dossier ``plugins`` de Galette. Par exemple, sous linux (en remplaçant `{url}` et `{version}` par les valeurs adéquates) :

source: Database initialisation
fr_fr: Initialisation de la base de données

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
fr_fr: Pour fonctionner, ce plugin requiert des tables dans la base de données. Référez-vous :ref:`à l'interface de gestion des plugins de Galette <plugins_managment>`.

source: And this is finished; Paypal plugin is installed :)
fr_fr: Et c'est terminé, le plugin Paypal est installé :)

source: Plugin configuration
fr_fr: Configuration du plugin

source: Once plugin has been installed, a `Paypal` group is added to the menu, with some new entries:
fr_fr: Une fois le plugin installé, un groupe `Paypal` est ajouté au menu, avec quelques nouvelles entrées :

source: `Payment form`: the payment form itself, which is accessible as a public page,
fr_fr: `Formulaire de paiement` : le formulaire de paiement lui même, qui est accessible en tant que page publique,

source: `Preferences`: plugin preferences, accessible for administrators and staff members.
fr_fr: `Préférences` : les préférences du plugin , accessible aux administrateurs et membres du bureau.

source: In order to work properly, you need to fill a very important value: your Paypal account code. You can either use the email address associated with your Paypal account (but you will need to chang it in Galette if it changes on Paypal) or your merchant identifier. To find your merchant identifiant, log in to Paypal and you will find it in your account preferences. Changing identifier is only allowed for administrators.
fr_fr: Pour que tout fonctionne correctement, vous devrez renseigner une valeur très importante : votre code de compte Paypal. Vous pouvez soit utiliser l'adresse de courriel associée à votre compte Paypal (mais vous devriez la changer dans Galette aussi si elle est modifiée chez Paypal) soit votre identifiant marchand. Pour trouver cet identifiant, connectez vous à Paypal et vous le trouverez dans les préférences de votre compte. La modification de l'identifiant est accessible aux administrateurs seulement.

source: Preferences screen also permit to edit amount related to contributions types, and to hide some types.
fr_fr: L'écran des préférences permet également d'associer des montant aux types de contributions, et de masquer certains types.

source: After that, any user can choose the contribution type, adjust the amount and pay from his Paypal account. If the user is a logged in member, and if the contribution type is a membershop extension, its membership wil be recalculated when the payment will be confirmed.
fr_fr: Après cela, tout utilisateur pourra choisir un type de contribution, ajuster le montant et payer depuis son compte Paypal. Si l'utilisateur était connecté à Galette, et que le type de contribution choisi amène une extension de l'adhésion, son adhésion sera recalculée lorsque le paiement sera confirmé.
