Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/changelog.po
Languages: fr_fr

source: Changelog
fr_fr: Journal des changements

source: Add print logo variable in PDF models (`#1741 <https://bugs.galette.eu/issues/1741>`_)
fr_fr: Ajout d'une variable pour le logo d'impression dans les modèles PDF (`#1741 <https://bugs.galette.eu/issues/1741>`_)

source: No longer use unsafe serialization for database storage (`#1744 <https://bugs.galette.eu/issues/1744>`_)
fr_fr: Ne plus utiliser la sérialisation pour le stockage en base (`#1744 <https://bugs.galette.eu/issues/1744>`_)

source: More explicit upgrade warning when already on latest release (`#1779 <https://bugs.galette.eu/issues/1779>`_)
fr_fr: Message d'avertissement davantage explicite lorsque l'on est déjà sur la dernière release (`#1779 <https://bugs.galette.eu/issues/1779>`_)

source: Prevent instance indexation from search engines bots (`#1784 <https://bugs.galette.eu/issues/1784>`_)
fr_fr: Empêcher l'indexation de l'instance par les moteurs de recherche (`#1784 <https://bugs.galette.eu/issues/1784>`_)

source: Clear old cache at upgrade (`#1788 <https://bugs.galette.eu/issues/1788>`_)
fr_fr: Suppression de l'ancien cache à la mise à jour (`#1788 <https://bugs.galette.eu/issues/1788>`_)

source: Change MySQL and MariaDB encoding (`#1794 <https://bugs.galette.eu/issues/1794>`_)
fr_fr: Modification de l'encodage MySQL et MariaDB (`#1794 <https://bugs.galette.eu/issues/1794>`_)

source: Add min size on dynamic fields (`#1795 <https://bugs.galette.eu/issues/1794>`_)
fr_fr: Ajout d'une taille minimale sur les champs dynamiques (`#1795 <https://bugs.galette.eu/issues/1794>`_)

source: Add amounts on contributions types (`#273 <https://bugs.galette.eu/issues/273>`_)
fr_fr: Ajout des montants sur les types de contributions (`#273 <https://bugs.galette.eu/issues/273>`_)

source: Add region field (`#583 <https://bugs.galette.eu/issues/583>`_)
fr_fr: Ajout du champ région (`#583 <https://bugs.galette.eu/issues/583>`_)

source: Check if new Galette version is available (`#1785 <https://bugs.galette.eu/issues/1785>`_)
fr_fr: Vérification de la disponibilité d'une nouvelle version de Galette (`#1785 <https://bugs.galette.eu/issues/1785>`_)

source: Improve member form display (`#1775 <https://bugs.galette.eu/issues/1775>`_)
fr_fr: Amélioration de l'affichage du formulaire adhérent (`#1775 <https://bugs.galette.eu/issues/1775>`_)

source: Add new specific constant to enable debug mode
fr_fr: Ajout d'une constante spécifique pour activer le mode de débogage

source: Option to disable social networks on member form/view (`#1802 <https://bugs.galette.eu/issues/1802>`_)
fr_fr: Option pour désactiver les réseaux sociaux à l'affichage et la modification des adhérents (`#1802 <https://bugs.galette.eu/issues/1802>`_)

source: Factorize permissions on core and dynamic fields (`#1798 <https://bugs.galette.eu/issues/1798>`_)
fr_fr: Factorisation des droits entre les champs du cœur et les champs dynamiques (`#1798 <https://bugs.galette.eu/issues/1798>`_)

source: Manage administrative documents (`#1216 <https://bugs.galette.eu/issues/1216>`_)
fr_fr: Gestion des documents administratifs (`#1216 <https://bugs.galette.eu/issues/1216>`_)

source: Allow plugins to provide their own fonts
fr_fr: Autoriser les plugins à fournir leurs propres polices de caractères

source: Use decimal for all amounts, drop defaults
fr_fr: Utilisation du format décimal pour tous les montants, suppression des valeurs par défaut

source: Rework PDF footer, fix pagination on attendance sheet (`#1816 <https://bugs.galette.eu/issues/1816>`_)
fr_fr: Revue du pied de page des PDF, correction de la pagination sur les listes d'émargement (`#1816 <https://bugs.galette.eu/issues/1816>`_)

source: Fix color for staff members on member cards (`#1814 <https://bugs.galette.eu/issues/1814>`_)
fr_fr: Correction de la couleur pour les membres du bureau sur les cartes adhérent (`#1814 <https://bugs.galette.eu/issues/1814>`_)

source: Display first staff members on public lists (`#1809 <https://bugs.galette.eu/issues/1809>`_)
fr_fr: Affichage en tête de liste des membres du bureau sur les pages publiques (`#1809 <https://bugs.galette.eu/issues/1809>`_)

source: Identify sponsors in members list (`#1792 <https://bugs.galette.eu/issues/1792>`_)
fr_fr: Identification des sponsors dans la liste des adhérents (`#1792 <https://bugs.galette.eu/issues/1792>`_)

source: Dispatch contribution into scheduled payments (`#1193 <https://bugs.galette.eu/issues/1193>`_)
fr_fr: Ventilation des contributions en paiements planifiés (`#1193 <https://bugs.galette.eu/issues/1193>`_)

source: Filter contributions list on type (`#1470 <https://bugs.galette.eu/issues/1470>`_)
fr_fr: Filtre des contributions selon leur type (`#1470 <https://bugs.galette.eu/issues/1470>`_)

source: Menu entry was not always correctly selected (`#1818 <https://bugs.galette.eu/issues/1818>`_)
fr_fr: L'entrée de menu n'était pas toujours correctement sélectionnée (`#1818 <https://bugs.galette.eu/issues/1818>`_)

source: Add payment type on transactions (`#574 <https://bugs.galette.eu/issues/574>`_)
fr_fr: Ajout du type de paiement sur les transactions (`#574 <https://bugs.galette.eu/issues/574>`_)

source: Remove non user related files from configuration folder (`#1822 <https://bugs.galette.eu/issues/1822>`_)
fr_fr: Suppression des fichiers non relatifs à l'utilisateur du dossier de configuration (`#1822 <https://bugs.galette.eu/issues/1822>`_)

source: Add monthly contribution membership (`#1438 <https://bugs.galette.eu/issues/1438>`_)
fr_fr: Ajout des contributions mensuelles (`#1438 <https://bugs.galette.eu/issues/1438>`_)

source: PDF Member card adaptative size (`#1817 <https://bugs.galette.eu/issues/1817>`_)
fr_fr: Taille adaptative des cartes de membre PDF (`#1817 <https://bugs.galette.eu/issues/1817>`_)

source: Cannot access tabs definition on some resolutions (`#1799 <https://bugs.galette.eu/issues/1799>`_)
fr_fr: Impossible d'accéder aux tabulations sur certaines résolutions (`#1799 <https://bugs.galette.eu/issues/1799>`_)

source: HTML Email preview shows source (`#1800 <https://bugs.galette.eu/issues/1800>`_)
fr_fr: L'aperçu HTML des courriels affiche le code (`#1800 <https://bugs.galette.eu/issues/1800>`_)

source: Fix scrolling in emailing preview's modal
fr_fr: Correction du défilement dans la fenêtre d'aperçu des courriels

source: Few fixes on dependency injection usage
fr_fr: Corrections sur l'utilisation de l'injection de dépendances

source: Number of show member automatically set to "all" (`#1803 <https://bugs.galette.eu/issues/1803>`_)
fr_fr: Le nombre d'adhérents affichés était automatiquement remis à "tous" (`#1803 <https://bugs.galette.eu/issues/1803>`_)

source: Groups modification not visually added on member form (`#1801 <https://bugs.galette.eu/issues/1801>`_)
fr_fr: Les modifications de groupes n'étaient pas visuellement affichées sur le formulaire adhérent (`#1801 <https://bugs.galette.eu/issues/1801>`_)

source: Fix redirection when dynamic file does not exists
fr_fr: Correction de la redirection lorsqu'un fichier dynamique n'existe pas

source: Menu horizontal scroll when name is too long (`#1805 <https://bugs.galette.eu/issues/1805>`_)
fr_fr: Défilement horizontal du menu lorsque le nom est trop long (`#1805 <https://bugs.galette.eu/issues/1805>`_)

source: Should not select a member as its own parent (`#1806 <https://bugs.galette.eu/issues/1806>`_)
fr_fr: Un adhérent ne peut pas être son propre parent (`#1806 <https://bugs.galette.eu/issues/1806>`_)

source: Add preferences footer in replacements (`#1808 <https://bugs.galette.eu/issues/1808>`_)
fr_fr: Ajout du pied de page des préférences dans les remplacements (`#1808 <https://bugs.galette.eu/issues/1808>`_)

source: Logo in mail signature is not shown (`#1783 <https://bugs.galette.eu/issues/1783>`_)
fr_fr: Le logo n'apparaissait pas dans la signature des courriels (`#1783 <https://bugs.galette.eu/issues/1783>`_)

source: Missing HTML editor for dynamic fields information field (`#1774 <https://bugs.galette.eu/issues/1774>`_)
fr_fr: L'éditeur HTML était absent sur le champ information des champs dynamiques (`#1774 <https://bugs.galette.eu/issues/1774>`_)

source: Update and maintainance pages are no longer working (`#1782 <https://bugs.galette.eu/issues/1782>`_)
fr_fr: Les pages de maintenance et de mise à jour ne fonctionnaient plus (`#1782 <https://bugs.galette.eu/issues/1782>`_)

source: Do not throw events on mass edition (`#1733 <https://bugs.galette.eu/issues/1733>`_)
fr_fr: Ne pas déclencher les évènements lors de l'édition de masse (`#1733 <https://bugs.galette.eu/issues/1733>`_)

source: Make cache version dependent (`#1787 <https://bugs.galette.eu/issues/1787>`_)
fr_fr: Le cache est désormais dépendant de la version (`#1787 <https://bugs.galette.eu/issues/1787>`_)

source: Check preferences website is valid (`#1789 <https://bugs.galette.eu/issues/1789>`_)
fr_fr: Vérification de la validité du site web (`#1789 <https://bugs.galette.eu/issues/1789>`_)

source: Link to asso website from logo (`#1790 <https://bugs.galette.eu/issues/1790>`_)
fr_fr: Lien vers site de l'asso depuis le logo (`#1790 <https://bugs.galette.eu/issues/1790>`_)

source: Rework UI messages (`#1786 <https://bugs.galette.eu/issues/1786>`_)
fr_fr: Amélioration des messages dans l'interface (`#1786 <https://bugs.galette.eu/issues/1786>`_)

source: Public pages access restriction (CVE-2024-24761 - `#1778 <https://bugs.galette.eu/issues/1778>`_)
fr_fr: Restriction d’accès des pages publiques (CVE-2024-24761 - `#1778 <https://bugs.galette.eu/issues/1778>`_)

source: Remove useless class from templates (`#1771 <https://bugs.galette.eu/issues/1771>`_) and fix social networks search dropdown (`#1760 <https://bugs.galette.eu/issues/1760>`_)
fr_fr: Suppression de classes inutiles (`#1771 <https://bugs.galette.eu/issues/1771>`_) et correction de la création de nouveaux réseaux sociaux (`#1760 <https://bugs.galette.eu/issues/1760>`_)

source: Ensure language is changed when login from cron; closes (`#1769 <https://bugs.galette.eu/issues/1769>`_)
fr_fr: Modification de la langue de l’utilisateur cron (`#1769 <https://bugs.galette.eu/issues/1769>`_)

source: Make replacements icon in PDF Model more visible (`#1770 <https://bugs.galette.eu/issues/1770>`_)
fr_fr: Icône des variables de remplacements davantage visible pour les modèles PDF (`#1770 <https://bugs.galette.eu/issues/1770>`_)

source: Fix possible issue on group creation (`#1773 <https://bugs.galette.eu/issues/1773>`_)
fr_fr: Correction d’un problème éventuel à la création de groupes (`#1773 <https://bugs.galette.eu/issues/1773>`_)

source: Fix URL redirection (`#1777 <https://bugs.galette.eu/issues/1777>`_)
fr_fr: Correction de la redirection d’URL (`#1777 <https://bugs.galette.eu/issues/1777>`_)

source: Title in members list causes an error (`#1756 <https://bugs.galette.eu/issues/1756>`_)
fr_fr: Le titre dans la liste des adhérents provoquait une erreur (`#1756 <https://bugs.galette.eu/issues/1756>`_)

source: Cannot enter a new social network name (`#1760 <https://bugs.galette.eu/issues/1760>`_)
fr_fr: Impossible de créer un nouveau nom de réseau social (`#1760 <https://bugs.galette.eu/issues/1760>`_)

source: Pagination and search on members list broken adding contribution (`#1761 <https://bugs.galette.eu/issues/1761>`_)
fr_fr: Pagination et recherche sur la liste des adhérents cassée à l'ajout d'une contribution (`#1761 <https://bugs.galette.eu/issues/1761>`_)

source: Contribution start date overload (`#1762 <https://bugs.galette.eu/issues/1762>`_)
fr_fr: Chevauchement de la date de début de contribution (`#1762 <https://bugs.galette.eu/issues/1762>`_)

source: Groups "accordion tree" not opened when a name contains a slash (`#1764 <https://bugs.galette.eu/issues/1764>`_)
fr_fr: "L'accordéon" des groupes n'était pas ouvert lorsque le nom contient un slash (`#1764 <https://bugs.galette.eu/issues/1764>`_)

source: open_basedir prevents files in /etc to be read (`#1765 <https://bugs.galette.eu/issues/1765>`_)
fr_fr: open_basedir empêche l'a lecture des fichiers dans /etc (`#1765 <https://bugs.galette.eu/issues/1765>`_)

source: Some issues with contribution amount set to 0 (`#1767 <https://bugs.galette.eu/issues/1767>`_)
fr_fr: Quelques problèmes sur les contributions avec un montant à 0 (`#1767 <https://bugs.galette.eu/issues/1767>`_)

source: Fatal error with PHP 7.4 (`#1768 <https://bugs.galette.eu/issues/1768>`_)
fr_fr: Erreur fatale avec PHP 7.4 (`#1768 <https://bugs.galette.eu/issues/1768>`_)

source: Cron user does not have lang defined (`#1769 <https://bugs.galette.eu/issues/1769>`_)
fr_fr: L'utilisateur cron n'avait pas de langue définie (`#1769 <https://bugs.galette.eu/issues/1769>`_)

source: PHP 8.1 minimum is required
fr_fr: PHP 8.1 minimum requis

source: Added
fr_fr: Ajouts

source: Modern UI
fr_fr: UI moderne

source: Major improvements on UI/UX and also responsiveness (`#1611 <https://bugs.galette.eu/issues/1611>`_)
fr_fr: Améliorations majeures sur les UI/UX et responsive (`#1611 <https://bugs.galette.eu/issues/1611>`_)

source: Use of YAML files instead of XML for exports configuration
fr_fr: Utilisation de YAML au lieu de XML pour la configuration des exports

source: New preference to show/hide borders around PDF member cards (`#184 <https://bugs.galette.eu/issues/184>`_)
fr_fr: Nouvelle préférence pour afficher/masquer les bordures autour des cartes de membres PDF (`#184 <https://bugs.galette.eu/issues/184>`_)

source: WebP image support (`#1681 <https://bugs.galette.eu/issues/1681>`_)
fr_fr: Support des images WebP (`#1681 <https://bugs.galette.eu/issues/1681>`_)

source: Removed free search on advanced search (`#1684 <https://bugs.galette.eu/issues/1684>`_)
fr_fr: Suppression de la recherche libre dans la recherche avancée (`#1684 <https://bugs.galette.eu/issues/1684>`_)

source: Check for minimal database version at install (`#1725 <https://bugs.galette.eu/issues/1725>`_)
fr_fr: Vérification de la version minimale de la base de données à l'installation (`#1725 <https://bugs.galette.eu/issues/1725>`_)

source: Resize and crop member picture to a fixed ratio (`#1717 <https://bugs.galette.eu/issues/1717>`_)
fr_fr: Retaillage et recadrage des images des adhérents selon un ratio fixe (`#1717 <https://bugs.galette.eu/issues/1717>`_)

source: Fixed
fr_fr: Corrections

source: Update issues (not defined constants) (`#1615 <https://bugs.galette.eu/issues/1615>`_)
fr_fr: Problèmes de mise à jour (constantes non définies) (`#1615 <https://bugs.galette.eu/issues/1615>`_)

source: Fatal error when cookie not set after login (`#1617 <https://bugs.galette.eu/issues/1617>`_)
fr_fr: Erreur fatale lorsque le cookie n'est pas défini après connexion (`#1617 <https://bugs.galette.eu/issues/1617>`_)

source: Sort members by status (`#1618 <https://bugs.galette.eu/issues/1618>`_)
fr_fr: Tri des adhérents par statut (`#16118 <https://bugs.galette.eu/issues/1618>`_)

source: Several PHP 8.1 compatibility fixes (`#1629 <https://bugs.galette.eu/issues/1629>`_, `#1655 <https://bugs.galette.eu/issues/1655>`_)
fr_fr: Correction de plusieurs problèmes de compatibilité PHP 8.1 (`#1629 <https://bugs.galette.eu/issues/1629>`_, `#1655 <https://bugs.galette.eu/issues/1655>`_)

source: Groups manager cannot edit their own information (`#1635 <https://bugs.galette.eu/issues/1635>`_)
fr_fr: Les responsables de groupes ne peuvent éditer leurs propres informations (`#1635 <https://bugs.galette.eu/issues/1635>`_)

source: Inconsistent count and display of reminders members (`#1491 <https://bugs.galette.eu/issues/1491>`_)
fr_fr: Compte et affichage différent des adhérents des rappels (`#1491 <https://bugs.galette.eu/issues/1491>`_)

source: Minimum PHP version not displayed on compat page (`#1682 <https://bugs.galette.eu/issues/1682>`_)
fr_fr: La version minimale de PHP n'était pas affichée sur la page de compatibilité (`#1682 <https://bugs.galette.eu/issues/1682>`_)

source: Simple members can't access their list of contributions (`#1675 <https://bugs.galette.eu/issues/1675>`_)
fr_fr: Les simples adhérents ne peuvent accéder à la liste de leurs contributions (`#1675 <https://bugs.galette.eu/issues/1675>`_)

source: Contributions mass removal (`#1661 <https://bugs.galette.eu/issues/1661>`_)
fr_fr: Suppression en masse de contributions (`#1661 <https://bugs.galette.eu/issues/1661>`_)

source: Disable inline images in mailings (`#1659 <https://bugs.galette.eu/issues/1659>`_)
fr_fr: Désactivation des images en ligne dans les courriels (`#1659 <https://bugs.galette.eu/issues/1659>`_)

source: Issue editing members with wrong values imported in dynamic choice fields (`#1650 <https://bugs.galette.eu/issues/1650>`_)
fr_fr: Problème à l'édition d'adhérents avec des fausses valeurs en liste de choix dynamiques (`#1650 <https://bugs.galette.eu/issues/1650>`_)

source: Parent group removed when a manager edit a group (`#1648 <https://bugs.galette.eu/issues/1648>`_)
fr_fr: Le groupe parent était perdu lorsqu'un responsable de groupe modifiait un groupe (`#1648 <https://bugs.galette.eu/issues/1648>`_)

source: Fix logo size on member card (`#1626 <https://bugs.galette.eu/issues/1626>`_)
fr_fr: Correction de la taille du logo sur les cartes de membre (`#1626 <https://bugs.galette.eu/issues/1626>`_)

source: Fix timeout using logo on PDF member cards (`#1726 <https://bugs.galette.eu/issues/1726>`_)
fr_fr: Correction d'un timeout à l'utilisation du logo dans les cartes de membre PDF (`#1726 <https://bugs.galette.eu/issues/1726>`_)

source: Fix dynamic files on contributions and transactions (`#1697 <https://bugs.galette.eu/issues/1697>`_)
fr_fr: Correction des fichiers dynamiques sur les contributions et transactions (`#1697 <https://bugs.galette.eu/issues/1697>`_)

source: Drop required fields on PDF member cards (`#781 <https://bugs.galette.eu/issues/781>`_)
fr_fr: Suppression de champs requis sur les cartes de membre PDF (`#781 <https://bugs.galette.eu/issues/781>`_)

source: Parent group can be lost when a groupmanager edits a group (`#1708 <https://bugs.galette.eu/issues/1708>`_)
fr_fr: Le groupe parent pouvait être perdu lorsqu'un responsable de groupe modifiait un groupe (`#1708 <https://bugs.galette.eu/issues/1708>`_)

source: Mass add contribution fail if data is missing (`#1694 <https://bugs.galette.eu/issues/1694>`_)
fr_fr: L'ajout en masse de contribution échouait s'il manquait une donnée (`#1694 <https://bugs.galette.eu/issues/1694>`_)

source: Dynamic contribution fields not rendered on advanced search (`#1693 <https://bugs.galette.eu/issues/1693>`_)
fr_fr: Les champs dynamiques des contributions n'étaient pas affichés dans la recherche avancée (`#1693 <https://bugs.galette.eu/issues/1693>`_)

source: Dynamic contributions choice fields on advanced search fail using postgres (`#1692 <https://bugs.galette.eu/issues/1692>`_)
fr_fr: Les champs dynamiques de type choix sur les contributions échouaient avec postgres (`#1692 <https://bugs.galette.eu/issues/1692>`_)

source: Several minor issues with RTL languages on PDF generation (`#1727 <https://bugs.galette.eu/issues/1727>`_)
fr_fr: Plusieurs issues mineures avec les langues RTL à la génération de PDF (`#1727 <https://bugs.galette.eu/issues/1727>`_)

source: Issues on transactions search with some date formats (`#1731 <https://bugs.galette.eu/issues/1731>`_)
fr_fr: Problème dans les recherches des transactions avec certains formats de date (`#1731 <https://bugs.galette.eu/issues/1731>`_)

source: Selected members were not reset creating a new mailing (`#1742 <https://bugs.galette.eu/issues/1742>`_)
fr_fr: Les adhérents sélectionnés n'étaient pas remis à jour à la création d'un nouvel envoi (`#1742 <https://bugs.galette.eu/issues/1742>`_)

source: Under the hood...
fr_fr: Sous le capot...

source: Template rendering is now assumed by `Twig <https://twig.symfony.com/>`_ instead of `Smarty <https://smarty.net/>`_ (`#1619 <https://bugs.galette.eu/issues/1619>`_)
fr_fr: Le rendu des pages est désormais assuré par `Twig <https://twig.symfony.com/>`_ au lieu de `Smarty <https://smarty.net/>`_ (`#1619 <https://bugs.galette.eu/issues/1619>`_)

source: Use of `Fomantic UI <https://fomantic-ui.com/>`_ framework for whole display (`#1324 <https://bugs.galette.eu/issues/1324>`_)
fr_fr: Utilisation du framework `Fomantic UI <https://fomantic-ui.com/>`_ pour l'ensemble de l'affichage (`#1324 <https://bugs.galette.eu/issues/1324>`_)

source: Update third party libraries
fr_fr: Mise à jour des bibliothèques tierces

source: No longer use atoum (dead project) for testing (`#1674 <https://bugs.galette.eu/issues/1674>`_)
fr_fr: Atoum (projet mort) n'est plus utilisé pour les tests (`#1674 <https://bugs.galette.eu/issues/1674>`_)

source: LibreJS compatibility (`#1642 <https://bugs.galette.eu/issues/1642>`_)
fr_fr: Compatibilité LibreJS (`#1642 <https://bugs.galette.eu/issues/1642>`_)

source: Legacy versions
fr_fr: Anciennes versions
