Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: fr_fr, it, uk

source: Galette's documentation
fr_fr: Documentation de Galette
it: Documentazione di Galette
uk: Документація Galette

source: `Galette <https://galette.eu>`_ is a `Free/Libre Open Source <https://en.wikipedia.org/wiki/Free_and_open-source_software>`__ membership management web application dedicated towards non profit organizations.
fr_fr: `Galette <https://galette.eu>`_ est un `logiciel Free/Libre Open Source <https://fr.wikipedia.org/wiki/Free/Libre_Open_Source_Software>`__ de gestion d'adhésion dédié aux association.
it: `Galette <https://galette.eu>`_ è un programma web `Free/Libre Open Source <https://en.wikipedia.org/wiki/Free_and_open-source_software>`__ di gestione dei soci delle associazioni non-profit.
uk: `Galette <https://galette.eu>`_ це `вільний відкритоджерельний <https://en.wikipedia.org/wiki/Free_and_open-source_software>`__ застосунок управління членством, присвячений некомерційним організаціям.

source: :doc:`installation manual <installation/index>`
fr_fr: :doc:`manuel d'installation <installation/index>`
it: :doc:`manuale installazione <installation/index>`
uk: :doc:`посібник з установлення <installation/index>`

source: :doc:`user manual <usermanual/index>`
fr_fr: :doc:`manuel utilisateur <usermanual/index>`
it: :doc:`manuale utente <usermanual/index>`
uk: :doc:`посібник користувача <usermanual/index>`

source: :doc:`plugins documentation <plugins/index>`
fr_fr: :doc:`documentation des plugins <plugins/index>`
it: :doc:`documentazione componenti aggiuntivi <plugins/index>`
uk: :doc:`документація розширень <plugins/index>`

source: About Galette
fr_fr: À propos de Galette
it: Su Galette
uk: Про Galette

source: The Galette project is kindly hosted by `TuxFamily <https://www.tuxfamily.org>`_:
fr_fr: Le projet Galette est gracieusement hébergé par `TuxFamily <https://www.tuxfamily.org>`_ :
it: Il progetto Galette è gentilmente ospitato da `TuxFamily <https://www.tuxfamily.org>`_:
uk: Проєкт Galette люб'язно розміщується `TuxFamily <https://www.tuxfamily.org>`_:

source: `Galette website <https://galette.eu/dc/?navlang=en>`_,
fr_fr: `Le site web de Galette <https://galette.eu/dc/?navlang=fr>`_,
it: `Sito web Galette <https://galette.eu/dc/?navlang=en>`_,
uk: `Вебсайт Galette <https://galette.eu/dc/?navlang=en>`_,

source: :doc:`a GIT repository to manage Galette source code <source_code>`,
fr_fr: :doc:`un dépôt GIT pour gérer le code source de Galette <source_code>`,
it: :doc:`un repository per la gestione del codice sorgente di Galette <source_code>`,
uk: :doc:`GIT-репозиторій для управління вихідним кодом Galette <source_code>`,

source: mailing lists,
fr_fr: listes de diffusion,
it: liste di distribuzione,
uk: списки розсилання,

source: There are also a few external services:
fr_fr: Quelques services externes sont également utilisés :
it: Ci sono anche alcuni altri servizi esterni:
uk: Є також кілька зовнішніх служб:

source: `a bug tracker <https://bugs.galette.eu/projects/galette/>`_, to declare issues or to ask for evolutions,
fr_fr: `un gestionnaire de bogues (tracker) <https://bugs.galette.eu/projects/galette/>`_, pour déclarer les anomalies ou demander des évolutions,
it: `un tracciatore di bug <https://bugs.galette.eu/projects/galette/>`_, per manifestare problemi o chiedere modifiche,
uk: `зневаджувач <https://bugs.galette.eu/projects/galette/>`_, щоб написати питання або запитати поліпшення,

source: `a wonderfull :p documentation <https://doc.galette.eu>`_, you are currently reading,
fr_fr: `une superbe :p documentation <https://doc.galette.eu>`_, que vous lisez actuellement,
it: `la fantastica :p documentazione <https://doc.galette.eu>`_, che state leggendo,
uk: `прекрасна :p документація <https://doc.galette.eu>`_, яку ви наразі читаєте,

source: `a voting system <https://vote.galette.eu>`_, you can vote for features,
fr_fr: `un système de vote <https://vote.galette.eu>`_, sur lequel vous pouvez voter pour des fonctionnalités,
it: `un sistema di voto <https://vote.galette.eu>`_, che potete usare per votare le funzionalità,
uk: `система голосування <https://vote.galette.eu>`_, де ви можете голосувати за можливості,

source: `a Github organization <https://github.com/galette>`_, used to run unit tests or documentation on readthedocs, among others,
fr_fr: `une organisation Github <https://github.com/galette>`_, utilisée pour lancer les tests unitaires ou la construction de la documentation sur, entre autres,
it: `l'organizzazione Github <https://github.com/galette>`_, utilizzata per effettuare i test del codice o pubblicare documentazione, tra l'altro,
uk: `організація Github <https://github.com/galette>`_, використовується, зокрема, для проведення модульних тестів або документування прочитаних документів,

source: `a continous integration system <https://github.com/galette/galette/actions>`_, that runs a bunch of tests each time a commit is done on the github mirror.
fr_fr: `un système d'intégration continue <https://github.com/galette/galette/actions>`_, qui lance une série de tests chaque fois qu'un commit est effectué sur le miroir github.
it: `un sistema di integrazione continua <https://github.com/galette/galette/actions>`_, che esegue una serie di test ogni volta che viene immessa una modifica al codice sorgente.
uk: `система безперервної інтеграції <https://github.com/galette/galette/actions>`_, що проводить купу тестів кожен раз, коли відбувається подання на дзеркалі Github.

source: `a Telemetry application <https://telemetry.galette.eu>`_ which handles and displays Telemetry data received from volunteer Galette instances.
fr_fr: `une application Telemetry <https://telemetry.galette.eu>`_ qui gère et affiche les informations de télémétrie reçues depuis les instances de Galette volontaires.
it: `una applicazione di telemetria <https://telemetry.galette.eu>`_ che gestisce e visualizza i dati di telemetria ricevuti dalle istanze volontarie di Galette.
uk: `застосунок Телеметрія <https://telemetry.galette.eu>`_ яка обробляє і відображає телеметричні дані, отримані від інстанцій добровольців Galette.

source: Galette documentation is released under the terms of the `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_ license, written using `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ and built with `Sphinx documentation builder <https://www.sphinx-doc.org>`_.
fr_fr: La documentation de `Galette <https://galette.eu/dc/>`_, publiée sous les termes de la licence `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_, est écrite en `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ et est construite à l'aide du `système de documentation Sphinx <https://www.sphinx-doc.org>`_.
it: La documentazione di Galette viene rilasciata sotto il regime di licenza `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_ , scritta usando `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ e compilata con `Sphinx documentation builder <https://www.sphinx-doc.org>`_.
uk: Документація Galette випускається відповідно до умов ліцензії `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_, написаній з використанням `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ та складеній за допомогою `Sphinx documentation builder <https://www.sphinx-doc.org>`_.

source: Sphinx allows to build documentation in various formats from the same sources. Galette's documentation is therefore available as HTML, PDF and EPUB formats; thanks to `Read the docs <https://readthedocs.io>`_.
fr_fr: Sphinx permet de construire la documentation dans des formats différents depuis une seule et même source. La documentation de Galette est donc disponible aux formats HTML, PDF et EPUB ; grâce à `Read the docs <https://readthedocs.io>`_.
it: Sphinx permette di compilare la documentazione in vari formati a partire dalla stessa sorgente. La documentazione di Galette è quindi disponibile come HTML, PDF e EPUB; grazie a `Read the docs <https://readthedocs.io>`_.
uk: Sphinx дозволяє збирати документацію в різних форматах з одних і тих же джерел. Таким чином, документація Galette доступна в форматах HTML, PDF і EPUB; завдяки `Read the docs <https://readthedocs.io>`_.
