Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/avancee.po
Languages: fr_fr

source: Experimented users
fr_fr: Utilisateurs expérimentés

source: Use only following instructions if you know what you are doing... "The management is not responsable for any case of [...]" :D
fr_fr: N'utilisez les instructions suivantes que si vous savez ce que vous faites... « La direction décline toute responsabilité en cas de [...] » :D

source: Adapt to your graphical chart
fr_fr: Adaptation à votre charte graphique

source: If you are comfortable with CSS stylesheets, you can adapt Galette CSS to fit your own colors. To achieve that, it is strongly discouraged to edit Galette CSS files, but rather the specific mecanism desinged for that. Create a ``galette_local.css`` file in your ``webroot/themes/default`` directory with your styles, it will be automatically included.
fr_fr: Si vous êtes à l'aise avec les styles CSS, vous pouvez adapter le CSS de Galette pour suivre votre charte graphique. Pour ce faire, il est fortement déconseillé de modifier les fichiers CSS de Galette, mais plutôt d'utiliser le mécanisme spécifique prévu pour cela ; Créez un fichier ``galette_local.css`` dans votre dossier ``webroot/themes/default`` avec vos propres styles, il sera inclus automatiquement.

source: Try to keep things as simple as possible. For example, if you want to change association name color (displayed under pages titles), you will find in Galette the CSS rule `#asso_name` that defines several parameters including the color. Then, in your stylesheet, you will just need the following:
fr_fr: Essayer de faire aussi simple que possible. Par exemple, si vous souhaitez changer la couleur de fond du nom de l'association (affiché sous le titre des pages), vous trouverez dans Galette la règle `#asso_name` qui définit plusieurs paramètres y compris les couleurs. Donc, dans votre feuille de style, vous aurez juste besoin de :

source: This will be enough to display your association name in red. Note that local CSS file and all issues it may cause will not be took into account by the Galette team, no support will be provided.
fr_fr: Ce sera suffisant pour afficher le nom de votre association en rouge. Notez que les CSS locales et les problèmes qu'elles pourraient causer ne seront pas prises en compte par l'équipe de Galette, aucun support ne sera fourni.

source: You also can override the print stylesheet, just create a ``galette_print_local.css`` file.
fr_fr: Vous pouvez également fournir une feuille de style pour l'impression, créez juste un fichier ``galette_print_local.css``.

source: Add and change strings
fr_fr: Ajouter et modifier des chaînes

source: It is possible if needed to customize translated strings in Galette - without editing any Galette source file. Just create a ``galette_{mylang}_local_lang.php`` file (where `{mylang}` must be replaced with the language, like `fr_FR.utf8` or `en_US`) in the ``lang`` directory. This file must contains a simple PHP array with the original string (the one in Galette source code) as index.
fr_fr: Il est possible au besoin de personnaliser les chaînes traduites dans Galette - sans modifier les sources de Galette. Créez simplement un fichier ``galette_{mylang}_local_lang.php`` (où `{mylang}` doit être remplacé par la langue, comme `fr_FR.utf8` ou `en_US`) dans le dossier ``lang``. Ce fichier doit contenir un simple tableau PHP avec la chaîne originale (celle dans le code source de Galette) en index.

source: As example, we want to change the "Password" string on the login page in french, translated as `Mot de passe :`. The original string is `Password:` (see ``galette/templates/default/index.tpl``), its french translation is `Mot de passe :` and we want to replace it with `Secret :`; so we will create the ``galette_fr_FR.utf8_local_lang.php`` with the following contents:
fr_fr: Par exemple, nous souhaiterions modifier la chaîne « Password » sur la page de connexion en fraçais, traduit par `Mot de passe :`. La chaîne originale est `Password:` (voir ``galette/templates/default/index.tpl``), sa traduction française est `Mot de passe :` et nous voulons la remplacer par `Secret :` ; donc nous allons créer le fichier ``galette_fr_FR.utf8_local_lang.php`` avec le contenu suivant :

source: Since Galette uses a cache system for translations, changes may not be visible immediately; you may have to restart PHP (or to clear cache). It is important to take the original string verbatim, punctuation included; and take care to escape single quotes (with a backslash) in all the strings.
fr_fr: Puisque Galette utilise un système de cache pour les traduction, les modification peuvent ne pas être visible immédiatement ; vous pouvez avoir à redémarrer PHP (ou nettoyer le cache). Il est important de prendra la chaîne d'origine telle quelle, ponctuation incluse ; et de prendre garde d'échapper les guillemets simples (avec un anti-slash) dans toutes les chaînes.

source: You also can override langs for plugins using the sam method, just place the file in plugins lang directory and name it ``{plugin}_{mylang}_local_lang.php`` where `{plugin}` is the routing name you can find in the ``_define.php`` file.
fr_fr: Vous pouvez également surcharger les langues des plugins en utilisant la même méthode, placez juste le fichier dans le dossier lang et nommez le ``{plugin}_{mylang}_local_lang.php`` où `{plugin}` est le nom du routage que vous trouverez dans le fichier ``_define.php``.

source: This will work only if you use Galette translation features, and not with native gettext.
fr_fr: Cela ne fonctionnera que si vous utilisez les fonctionnalités de traduction de Galette, pas gettext natif.

source: Change session lifetime
fr_fr: Changer la durée de session

source: Per default, Galette will create session with default lifetime duration (and it seems browsers acts differently in this case). You can anyways define a constant named ``GALETTE_TIMEOUT`` to change session lifetime using behavior configuration:
fr_fr: Par défaut, Galette va créer une session avec la valeur par défaut pour sa durée (et il semble que les navigateurs agissent différemment dans ce cas). Vous pouvez toutefois définir une constante nommée ``GALETTE_TIMEOUT`` pour changer la durée de la session en utilisant la configuration du comportement :

source: Log IP addresses behind a proxy
fr_fr: Enregistrement des adresses IP derrière un proxy

source: If your Galette instance is behind a proxy, IP address stored in history will be the proxy one, and not the user one :(
fr_fr: Si votre instance de Galette se trouve derrière un proxy, l'adresse IP enregistrée dans l'historique sera celle du proxy, pas celle de l'utilisateur :(

source: To fix that, use behavior configuration to create a constant named ``GALETTE_X_FORWARDED_FOR_INDEX`` like:
fr_fr: Pour corriger cela, utilisez la configuration du comportement pour créer une constante nommée ``GALETTE_X_FORWARDED_FOR_INDEX`` comme suit :

source: Each proxy server will add its own address on the list, example above will work only if there is only one proxy server.
fr_fr: Chaque serveur proxy ajoutera sa propre adresse à la liste, l'exemple ci dessus ne fonctionnera que s'il n'y a qu'un seul serveur proxy.

source: For security reasons, do not use this if your instance is not behind a proxy!
fr_fr: Pour des raisons de sécurité, n'utilisez pas cela si votre instance n'est pas derrière un proxy !

source: External stats
fr_fr: Statistiques externes

source: Many statistics plaftforms relies on an extra Javascript block to work. You can create a ``tracking.js`` file under ``webroot/themes/default`` directory, it will be automatically included.
fr_fr: De nombreux systèmes de statistiques requièrent un bloc Javascript pour fonctionne. Vous pouvez créer un fichier ``tracking.js`` dans le dossier ``webroot/themes/default``, il sera inclus automatiquement.

source: Galette uses Javascript to work. If the code you add in the ``tracking.js`` file is incorrect, this may break Galette!
fr_fr: Galette utilise Javascript pour fonctionner. Si le code ajouté dans votre fichier ``tracking.js`` est incorrect, cela peut casser Galette !

source: Cards size and count
fr_fr: Taille et nombre de cartes

source: Galette preferences allows to specify spacing for cards, but not their with, nor the number of lines and columns. You can use behavior configuration to configure cards`, following constants are provided:
fr_fr: Les préférences de Galette permettent de spécifier l'espacement des cartes, mais pas le nombre de lignes ou de colonne. Vous pouvez utiliser la configuration du comportement pour les paramètres des cartes, le constantes suivantes sont fournies :

source: Changing those values may cause gaps; change them with caution, and do not forget to test the result ;)
fr_fr: Modifier ces valeurs peut causer des incohérences ; modifiez les avec parcimonie, et n'oubliez pas de tester le résultat ;)

source: ``GALETTE_CARD_WIDTH`` defines cards width,
fr_fr: ``GALETTE_CARD_WIDTH`` détermine la largeur des cartes,

source: ``GALETTE_CARD_HEIGHT`` defines cards height,
fr_fr: ``GALETTE_CARD_HEIGHT`` détermine la hauteur des cartes,

source: ``GALETTE_CARD_COLS`` defines the number of columns,
fr_fr: ``GALETTE_CARD_COLS`` détermine le nombre de colonnes,

source: ``GALETTE_CARD_ROWS`` defines the number of lines.
fr_fr: ``GALETTE_CARD_ROWS`` détermine le nombre de lignes.

source: CSV exports
fr_fr: Exports CSV

source: You can setup paremeters exports with a `YAML <https://yaml.org/>`_ file instead of an XML one.
fr_fr: Vous pouvez configurer des exports paramétrés avec un fichier `YAML <https://yaml.org/>`_ au lieu d'un fichier XML.

source: Galette provides a parameted CSV exports system. Only one parameted export is provided, but you can add your own to the ``config/exports.yaml`` file.
fr_fr: Galette fournit un système d'exports CSV paramétrés. Un seul export paramétré est fourni, mais vous pouvez ajouter les vôtres dans le fichier ``config/exports.yaml``.

source: Legacy XML configuration file is still supported; if a duplicate identifier is found, YAML file takes precedence.
fr_fr: L'ancien fichier de configuration XML est toujours supporté ; si un doublon est trouvé, le fichier YAML prend le pas.

source: Let's examine existing "cotisations" parameted export:
fr_fr: Examinons l'export paramétré "cotisations" :

source: each array entry is a unique identifier, lowercase without spaces or special character
fr_fr: chaque entrée de tableau est un identifiant unique, en minuscules sans espaces or caractère spécial

source: `name` and `description` are mandatory as used to display each parameted export in the user interface
fr_fr: `name` et `description` sont requis puisque utilisés pour afficher chaque export paramétré dans l'interface utilisateur

source: `filename` sets the filename for output file
fr_fr: `filename` détermine le nom de fichier de sortie

source: `query` is the query to execute, it's mandatory. There is no other limitation than the SQL engine ones, expect you cannot send them any parameters
fr_fr: `query` est la requête à exécuter, c'est requis. Il n'y a pas d'autre limite que celles du moteur de base de données, à la différence que vous ne pouvez envoyer aucun paramètre

source: `headers` manages columns titles:
fr_fr: `headers` gère les titres des colonnes :

source: like in the above example, an array of columns titles of your own
fr_fr: comme dans l'exemple ci-dessous, un tableau des titres que vous aurez défini

source: if not present, Galette fields names will be exported. You can use named columns in your SQL query (``SELECT nom_adh AS "Column title" FROM ...``)
fr_fr: si ce n'est pas présent, les noms des champs de Galette seront exportés. Vous pouvez utiliser des colonnes nommées dans votre requête SQL (``SELECT nom_adh AS "Column title" FROM ...``)

source: set to false (``headers: false``) to disable column headers output
fr_fr: mettre à faux (``headers: false``) pour désactiver la sortie des en-têtes de colonnes

source: `separator` is the CSV separator that will be used. Possible values are:
fr_fr: `separator` est le séparateur CSV qui sera utilisé. Les valeurs possibles sont :

source: semicolon (``;``) - default
fr_fr: point-virgule (``;``) - défaut

source: comma (``,``)
fr_fr: virgule (``,``)

source: tabulation character (``\t``)
fr_fr: caractère de tabulation (``\t``)

source: `quote` either double quote - default - or simple quote character
fr_fr: `quote` soit un guillemet double - défaut - soit un guillemet simple

source: to disable an export, you can add ``inactive: true``
fr_fr: pour désactiver un export, vous pouvez ajouter ``inactive: true``

source: Administration tools
fr_fr: Outils d'administration

source: All the admin tools operation are destructive, use it with cautions, and **make sure you did a database backup** before!
fr_fr: Toutes les opérations administrateurs sont destructives, utilisez les avec parcimonie et **assurez-vous de faire une sauvegarde de votre base de données** auparavant !

source: There are a few tools provided for Galette admin that permits to:
fr_fr: Quelques outils d'administration sont fournis par galette, qui permettent de :

source: **reinitialize mailings contents** will reset all emails contents to default values,
fr_fr: **réinitialiser les contenus des courriels** réinitialisera tous les contenus des courriels administratifs à leurs valeurs par défaut,

source: **reinitialize fields configuration** will reset all members core fields to their default value. This does not imply dynamic fields,
fr_fr: **réinitialiser la configuration des champs** va remette à zéro les champs du cœur à leurs valeurs par défaut ; Cela n'implique pas les champs dynamiques,

source: **reinitialize PDF models** will reset ll PDF models to default values,
fr_fr: **réinitialiser les modèles PDF** réinitialisera les modèles PDF à leurs valeurs par défaut,

source: **generate empty logins and passwords** those informations are required to improve security, but sometimes missing (if you import a CSV for example). This feature will set random values as login and password fields that would be empty in database.
fr_fr: **générer des login et mot de passe vides** ces informations sont requises pour améliorer la sécurité, mais elles sont parfois manquantes (si vous importez un CSV par exemple).

source: Galette modes
fr_fr: Modes de galette

source: Several modes are provided in Galette you can configure with ``GALETTE_MODE`` constant (:ref:`see Galette behavior configuration <behavior>`). This directive can take the following values:
fr_fr: Plusieurs modes sont fournis dans Galette vous pouvez configurer avec la cnstante ``GALETTE_MODE`` (:ref:`voir la configuration du comportement de Galette <behavior>`). Cette directive peut prendre les valeurs suivantes :

source: ``PROD``: production mode (non production instance should be on an other mode). This is the default mode for releases, but it may change in development branch.
fr_fr: ``PROD`` : mode production (aucune instance de production ne devrait être sur un autre mode). C'est le mode par défaut pour les versions, mais il peut changer sur la branche de développement.

source: ``DEV``: development mode:
fr_fr: ``DEV`` : mode développement :

source: unstable/not finished parts will be activated,
fr_fr: les parties non terminées ou instables seront activées,

source: some data will not be stored in session,
fr_fr: certaines données ne seront pas stockées en session,

source: default log level is set to ``DEBUG``,
fr_fr: le niveau de verbosité des logs est défini à ``DEBUG``,

source: news won't be cached,
fr_fr: les nouvelles ne seront pas mises en cache,

source: database verion check will not be done.
fr_fr: la vérification de la version de la base de données ne sera pas effectuée.

source: ``DEMO``: demonstration mode, the same as ``PROD`` but with some features disabled like sending emails, modifying superadmin data, ...
fr_fr: ``DEMO`` : mode démonstration, le même que ``PROD`` mais avec certaines fonctionnalités désactivées comme l'envoi de courriels, la modification des informations du super administrateur, ...

source: ``TEST``: reserved for unit tests.
fr_fr: ``TEST`` : réservé aux tests unitaires.

source: ``MAINT``: maintainance mode. Only super admin will be able to login.
fr_fr: ``MAINT`` : mode maintenance. Seul le super admin pourra se connecter.

source: Behavior configuration
fr_fr: Configuration du comportement

source: It is possible to change some of Galette behaviors:
fr_fr: Il est possible de modifier certains comportements de Galette :

source: `GALETTE_MODE`: :ref:`see Galette modes <galettemodes>`;
fr_fr: `GALETTE_MODE` : :ref:`voir les modes de Galette <galettemodes>` ;

source: `NON_UTF_DBCONNECT`: disable explicitely UTf-8 connection to the database (for users who see encoding issues);
fr_fr: `NON_UTF_DBCONNECT` : désactive la connexion explicite en UTF8 à la base de données (pour les utilisateurs qui rencontrent des problèmes d'encodage) ;

source: you'll find in related part of the documentation you can use behavior configuration for some other usages (such as PDF cards settings, session lifetime, ...).
fr_fr: vous verrez dans d'autres parties de la documentation qu'il est possible d'utiliser la configuration du comportement pour d'autres usages (tels que les cartes PDF, la durée de vie de la session, ...).

source: You can add those directives by declaring constants in the ``galette/config/behavior.inc.php``.
fr_fr: Vous pouvez ajouter ces directives en déclarant des constantes via le fichier ``galette/config/behavior.inc.php``.

source: For example:
fr_fr: Par exemple :
