Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/generalites.po
Languages: fr_fr, uk

source: Generalities
fr_fr: Généralités
uk: Загальні відомості

source: Rights
fr_fr: Droits
uk: Права

source: We can see several rights level in Galette, allowing access to different parts and features of the application. Levels are:
fr_fr: Nous pouvons observer plusieurs niveaux de droits dans Galette, autorisant l'accès aux différentes parties et fonctionnalités de l'application. Les niveaux sont :
uk: Ми маємо декілька рівнів прав у Galette, що дозволяють отримати доступ до різних частин та функцій застосунку. Рівні:

source: **super administrator** is a special user (the only one that is not a member) created at installation,
fr_fr: **super administrateur** est un utilisateur spécial (le seul qui ne soit pas un adhérent) créé à l'installation,
uk: **суперадміністратор** - це спеціальний користувач (єдиний, який не є членом), створений під час установлення,

source: **administrators** are members for who the "administrator" checkbox has been checked,
fr_fr: **administrateurs** sont des adhérents pour lesquels la case « administrateur » a été cochée,
uk: **адміністратори** - це члени, для яких установлено прапорець "адміністратор",

source: **staff members** have a specific status (President, Treasurer, Secretary, ...),
fr_fr: **membres du bureau** qui ont un statut spécifique (Président, Trésorier, Secrétaire, ...),
uk: **співробітники** мають певний стан (президент, скарбник, секретар, ...),

source: **groups managers** have only rights on the groups they manage,
fr_fr: **responsables de groupes** possèdent des droits sur les groupes qu'ils gèrent uniquement,
uk: **менеджери груп** мають лише права на групи, якими вони управляють,

source: **up to date members** are members whose account are active, and whose subscription are up to date,
fr_fr: **adhérents à jour** sont des adhérents dont le compte est actif, et qui sont à jour de leur contribution,
uk: **діяльні члени** - це члени, обліковий запис яких діяльний, і так само підписка,

source: **members** are members whose account is inactive or whose subscriptions are not up to date,
fr_fr: **membres** sont des adhérents dont le compte est inactif ou dont la souscription n'est pas à jour,
uk: **члени** - це члени, обліковий запис яких бездіяльний або підписка яких не оновлена,

source: simple **visitors**.
fr_fr: simples **visiteurs**.
uk: прості **відвідувачі**.

source: Staff members, administrators as well as the super administrator can create, edit and remove members, contributions, transactions, send emailings, ...
fr_fr: Les membres du bureau, les administrateurs ainsi que le super administrateur peuvent créer, modifier et supprimer des adhérents, contributions, transactions, envoi d'emailings, ...
uk: Співробітники, адміністратори, а також суперадміністратор можуть створювати, редагувати та видаляти членів, внески, перекази, надсилати розсилання е-поштою, ...

source: Administrators have also access to the application configuration, excepted super admin information.
fr_fr: Les administrateurs ont également accès à la configuration de l'application, à l'exception des informations du super administrateur.
uk: Адміністратори також мають доступ до конфігурації програми, крім відомостей про суперадміністратора.

source: The super administrator has a full access to the application, but not to all features. Indeed, this is not a member account, and it cannot have some of required informations. He of course can change its own login informations from application preferences.
fr_fr: Le super administrateur a un accès complet à l'application, mais pas à toutes les fonctionnalités. En effet, il ne s'agit pas d'un compte adhérent, et il peut ne pas posséder les informations nécessaires. Il peut bien entendu modifier ses propres informations d'authentification depuis les préférences de l'application.
uk: Суперадміністратор має повний доступ до програми, але не до всіх функцій. Дійсно, це не обліковий запис члена, і він не може мати деякі необхідні відомості. Звичайно, він може змінити власні відомості для входу в налаштуваннях застосунку.

source: Members can change their own informations, and can see their contributions and transactions (as read only).
fr_fr: Les adhérents peuvent modifier leurs propres informations, et voir leurs contributions et transactions (en lecture seule).
uk: Члени можуть змінювати власні відомості та бачити свої внески та перекази (лише для читання).

source: Visitors can - if this is parameted in preferences - access to public pages (trombinoscope, public members list) but can also register :)
fr_fr: Les visiteurs peuvent - si c'est paramétré en ce sens dans les préférences - accéder aux pages publiques (trombinoscope, liste publique des adhérents) mais peuvent aussi s'enregistrer :)
uk: Відвідувачі можуть - якщо це встановлено в налаштуваннях - отримати доступ до загальнодоступних сторінок (дошка членів, загальнодоступний список членів), але також можуть зареєструватися :)

source: Group managers
fr_fr: Responsables de groupe
uk: Керівники груп

source: With the stricter configuration, groups managers can show and search on members of their groups, and see accessible data for members. On members and cards, you can :ref:`configure which fields are accessible <fields_acls>`.
fr_fr: Avec la configuration la plus stricte, les responsables de groupe peuvent voir et rechercher les adhérents de leurs groupes, et voir les informations qui leur sont accessibles sur les adhérents. Sur la liste et les fiches des adhérents, vous pouvez :ref:`configurer les champs qui sont accessibles <fields_acls>`.
uk: Завдяки суворішій конфігурації керівники груп можуть відображати та шукати учасників своїх груп, а також бачити які дані їм доступні. На учасниках і картках ви можете : ref:`налаштувати котрі поля доступні <fields_acls>`.

source: From the preferences, you can also :ref:`give groups managers extra rights <pref_rights>`, like editing or creating members.
fr_fr: Depuis les préférences, vous pouvez également :ref:`attribuer davantage de droits aux responsables de groupe <pref_rights>`, comme la modification ou la création d'adhérents.
uk: У налаштуваннях ви також можете :ref:`надати керівникам груп додаткові права <pref_rights>`, наприклад, редагувати або створювати учасників.

source: Management rules
fr_fr: Règles de gestion
uk: Правила управління

source: Due dates are calculated by day. If a member pay into before the end of his membership, duration of this membership will be added to remaining days. Example:
fr_fr: Les dates d'échéance sont calculées au jour près. Si un adhérent renouvelle sa souscription avant son échéance, la durée de son adhésion sera ajoutée au jours restants. Par exemple :
uk: Кінцеві строки обчислюються по днях. Якщо член платить до припинення свого членства, тривалість цього членства буде додана до днів, що залишилися. Приклад:

source: Roger subscribed on 2004-01-01 for one year,
fr_fr: Roger a souscrit le 01/01/2004 pour un an,
uk: Богуслав зробив передплату 01.01.2004 на один рік,

source: if he pays into for a year on 2004-12-13,
fr_fr: s'il renouvelle sa souscription pour un an le 13/12/2004,
uk: якщо він платить за рік з 2004-12-13,

source: his due date will become 2006-01-01.
fr_fr: sa date d'échéance deviendra le 01/01/2006.
uk: його кінцевий строк стане 01.01.2006.

source: No day will be forget.
fr_fr: Aucun jour ne sera oublié.
uk: Жоден день не буде забутим.

source: At the contrary, if a member renew his membership late, we evaluate again his membership duration:
fr_fr: Au contraire, si un adhérent renouvelle sa souscription en retard, la durée de son adhésion sera recalculée :
uk: Навпаки, якщо член пізно поновлює членство, ми знову оцінюємо тривалість його членства:

source: if he pays into for a year on 2006-01-13,
fr_fr: s'il renouvelle sa souscription pour un an le 13/01/2006,
uk: якщо він платить за рік 13.01.2006,

source: his due date will become 2006-01-13.
fr_fr: sa date d'échéance deviendra le 13/01/2006.
uk: його кінцевий строк стане 2006-01-13.

source: He is not an up to date member from 2006-01-01 to 2006-01-13... On paper at least :)
fr_fr: Il ne sera plus membre à jour du 01/01/2006 au 13/01/2006... Sur le papier tout au moins :)
uk: Він не є наявним членом з 01.01.2006 по 13.01.2006... Принаймні на папері :)

source: Those rules are flexible because you can freely change membership dates on contributions, if you have rights to add or update them. We can imagine an association who stores all contributions on the first day of the next month (offering its members a longer membership time).
fr_fr: Ces règles sont flexibles puisque vous pouvez modifier les dates d'adhésion à la création des contributions, si vous avez les droits pour les ajouter et les modifier. Imaginons une association qui enregistrerait ses contributions le premier jour du mois suivant (et qui offrirait une durée d'adhésion un peu plus longue à ses adhérents).
uk: Ці правила є гнучкими, оскільки ви можете вільно змінювати дати членства на внески, якщо у вас є права на їх додавання або оновлення. Ми можемо уявити собі товариство, яке зберігає всі внески в перший день наступного місяця (пропонуючи своїм членам триваліший час членства).

source: Interface
uk: Інтерфейс

source: We do our best for the Galette interface to be:
fr_fr: Nous faisons notre possible pour que l'interface de Galette soit :
uk: Ми робимо все, щоб інтерфейс Galette був:

source: logical and consistent (you will always find icons at familiar places),
fr_fr: logique et cohérente (vous trouverez toujours les icônes à des emplacement familiers),
uk: логічним і послідовним (ви завжди знайдете піктограми у знайомих місцях),

source: web standards compliant (HTML and CSS valid),
fr_fr: respectueuse des standards du web (valide HTMl et CSS),
uk: сумісним з вебстандартами (HTML та CSS),

source: HTML semantic respectful,
fr_fr: respectueuse de la sémantique HTML,
uk: семантично поважним до HTML,

source: working even if Javascript is disabled (as possible, but really you should enable Javascript to really take advantage of Galette),
fr_fr: fonctionnelle même lorsque le Javascript est désactivé (autant que faire se peut, mais vous devriez vraiment activer Javascript pour profiter de Galette),
uk: таким що працює, навіть якщо Javascript вимкнено (наскільки це можливо, але насправді вам слід увімкнути Javascript, щоб повноцінно скористатися можливостями Galette),

source: accessible (without any WCAG, WAI or equivalent tests run).
fr_fr: accessible (sans qu'aucun test WCAG, WAI ou équivalent ne soit lancé).
uk: доступним (без запуску тестів WCAG, WAI або еквівалентних).

source: If you find places where one of those points is incorrect, do not hesitate to tell us on the tracker or on the mailing list!
fr_fr: Si vous trouvez des endroits où l'un de ces points n'est pas respecté, n'hésitez pas à nous en faire part sur le tracker ou les listes de diffusion !
uk: Якщо ви знайдете місця, де один із цих пунктів не діє, не соромтеся повідомити нам про це за допомогою відстежувача чи списку розсилання!

source: Galette provide a "mobile compatible" UI, but it has not been designed for that. Therefore, it may be difficult or worst to use; in this case we do our best, but all devices cannot be tested!
fr_fr: Galette fournit une interface « compatible mobile », mais n'a pas été conçu pour ça. De ce fait, il peut être difficile à utiliser ; dans ce cas nous faisons de notre mieux, mais tous les appareils ne peuvent être testés !
uk: Galette надає "мобільно-сумісний" інтерфейс, але він не розроблений для цього. Тому його може бути важко або майже неможливо використовувати; ми робимо все можливе, але всі мобільні пристрої не реально протестувати!

source: Mobile display is currently a plus and not a fundation of the UI. Improvements can be done, this will just not be a priority. Note that we have in mind to rework the whole UI, with a better support.
fr_fr: L'interface mobile n'est actuellement pas native . Des améliorations peuvent être apportées, mais ce n'est pas une priorité. Notez qu'une refonte complète de l'interface est prévue, avec un meilleur support.
uk: Мобільний дисплей наразі є додатком, а не основою інтерфейсу користувача. Ми можемо його поліпшувати, але це не буде в пріоритеті. Завбачте, що ми плануємо переробити весь призначений для користувача інтерфейс, поліпшивши його підтримку.

source: Telemetry
fr_fr: Télémétrie
uk: Телеметрія

source: Galette propose to send some telemetry informations:
fr_fr: Galette propose d'envoyer quelques informations de télémétrie :
uk: Galette пропонує надіслати деякі телеметричні відомості:

source: **entirely anonymous**: no information about your association or your members is sent,
fr_fr: **entièrement anonymes** : aucune information sur votre association ou vos adhérents n'est envoyée,
uk: **повністю таємно**: не надсилаються відомості про ваше товариство або ваших членів,

source: **deliberately blurred**: we retrieve an estimation of members count, never a real count,
fr_fr: **volontairement floues** : nous récupérons une estimation du nombre d'adhérents, jamais un compte réel,
uk: **навмисно розмитий**: ми отримуємо лише оцінку кількості членів, а не справжню кількість,

source: sent by a **secured** way (`HTTPS`) on https://telemetry.galette.eu.
fr_fr: envoyée de manière **sécurisée** (`HTTPS`) sur https://telemetry.galette.eu.
uk: надсилається **захищеним** способом (`HTTPS`) на https://telemetry.galette.eu.

source: Sending telemetry data is a manual process, nothing will be send until you **explicitely** ask it. With those informations, we can have a better knwownledge of different usages of Galette, their number of member or contributions, plugins used, ...
fr_fr: L'envoi des données est un processus manuel, rien n'est envoyé jusqu'à ce que vous l'autorisiez **explicitement**. Avec ces informations, nous aurons une meilleure connaissance des différentes usages de Galette, le nombre d'adhérents et de contributions gérées, les plugins utilisés, ...
uk: Надсилання даних телеметрії - це ручний процес, нічого не буде надіслано, поки ви **явно** не попросите про це. За допомогою цих даних ми зможемо краще дізнатися про різні види використання Galette, їх приблизну кількість членів або внесків, використовувані розширення тощо.

source: Those informations are useful for the project development and promotion. When you send those informations, you can review data that would be sent.
fr_fr: Ces informations sont utiles pour le développement et la promotion du projet. Lorsque vous envoyez ces informations, vous pouvez vérifier ce qui serait envoyé.
uk: Ці відомості корисні для розробки та просування проєкту. Коли ви надсилаєте їх, ви можете переглянути дані, що будуть надіслані.

source: Preview Telemetry data
fr_fr: Prévisualisation des données de télémétrie
uk: Передогляд даних відстеження

source: After data has been sent once, Galette will propose to send an update from time to time. You can also send them from Galette preferences.
fr_fr: Lorsque les données ont été envoyées une première fois, Galette proposera de les mettre à jour de temps à autre. Vous pouvez aussi les envoyer depuis les préférences de Galette.
uk: Після того, як дані будуть надіслані один раз, Galette запропонує час від часу надсилати оновлення. Ви також можете надіслати їх із налаштувань Galette.

source: Telemetry update reminder
fr_fr: Rappel de mise à jour de la télémétrie
uk: Нагадування про оновлення відстеження

source: It is also possible to register your association on the website, of course, not anonymously, but it is not possible to link telemetry and registration. New references are moderated.
fr_fr: Il est également possible d'enregistrer votre association comme utilisateur de Galette, de manière non anonyme bien sûr, mais il est impossible de lier les informations de télémétrie et d'enregistrement. Les nouvelles références sont modérées.
uk: Також можна зареєструвати своє товариство на сайті, звичайно, не таємно, але зв'язати телеметрію і реєстрацію неможливо. Нові реєстрації модеруються.

source: You can update your registration informations from Galette preferences. The form will be blank (because it is not possible to retrieve data you've sent) but all data will be updated because your instance has a unique registration identifier designed for that.
fr_fr: Vous pouvez mettre à jour vos informations d'enregistrement depuis Galette. Le formulaire sera vide (parce qu'il est impossible de récupérer les données que vous avez préalablement envoyées) mais toutes les données seront mises à jour puisque votre instance possède un identifiant unique d'enregistrement.
uk: Ви можете оновити свої реєстраційні дані в налаштуваннях Galette. Форма буде порожньою (бо неможливо отримати дані, які ви надіслали), але всі дані буде оновлено, тому що ваш зразок має неповторюваний реєстраційний ідентифікатор, призначений для цього.

source: Telemetry from preferences
fr_fr: Télémétrie depuis les préférences
uk: Відстеження налаштувань

source: A new panel has been added on Galette dashboard to send telemetry informations and/or register your instance. Once those steps has been completed, the panel will dissapear. You aslo can choose to just disable it.
fr_fr: Un nouveau panneau a été ajouté au tableau de bord Galette pour envoyer vos informations de télémétrie et/ou enregistrer votre instance. Une fois ces étapes complétées, le panneau disparaîtra. Vous pouvez également choisir de le désactiver.
uk: На дошці даних Galette була додана нова панель для надсилання телеметричних відомостей та/або реєстрації вашого зразка. Після виконання цих кроків панель зникне. Ви також можете просто вимкнути її.

source: Telemetry on dashboard
fr_fr: Télémétrie sur le tableau de bord
uk: Відстеження на дошці даних
