Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/pdf_models.po
Languages: fr_fr

source: PDF models
fr_fr: Modèles PDF

source: PDF models are provided for several outputs : an invoice model, a receipt model and a membership from model are currently available. All of them inherits from a `Global` model.
fr_fr: Des modèles PDF sont fournis pour différentes sorties : un modèle de facture, un modèle de reçu et une fiche d'adhésion sont actuellement disponibles. Tous héritent du modèle `Global`.

source: PDF models management
fr_fr: Gestion des modèles PDF

source: Models inheritance
fr_fr: Héritage des modèles

source: The global model defines three distincts parts:
fr_fr: Le modèle global définit trois parties distinctes :

source: header,
fr_fr: en-tête,

source: footer,
fr_fr: pied de page,

source: CSS styles.
fr_fr: styles CSS.

source: Each model which inherits from `Global` will automatically obtain same header and footer except if the new model redefines them, in which case only specific values will be applied.
fr_fr: Chaque modèle qui hérite de `Global` obtiendra automatiquement les en-tête et pied de page sauf si le nouveau modèle les redéfinit, auquel cas seules les valeurs spécifiques seront appliquées.

source: For CSS properties it is a bit different: `Global` model properties will always be applied, and specific model properties will be appended (jsut like real CSS stylesheets).
fr_fr: Pour les propriétés CSS, c'est un peu différent : les propriétés du modèle `Global` seront toujours appliquées,et les propriétés spécifiques au modèle seront ajoutées (comme dans une feuille de style CSS).

source: Generalities
fr_fr: Généralités

source: In addition of header, footer and CSS styles, a model defines a title, a sub title and a body.
fr_fr: En plus des en-tête, pied de page et styles CSS, un modèle définit un titre, un sous titre et un corps.

source: Each of those fields can take some replacement values, refer to the inline help from the user interface to get details. They also can contains internationnalized texts like `_T("My text")` that relies on Galette standard translation capacities.
fr_fr: Chacun de ces champs peut utiliser une valeur de remplacement, voyez l'aide dans l'interface utilisateur pour plus de détails. Ils peuvent aussi contenir des chaînes internationalisées comme `_T("My text")` qui se base sur les capacités standard de traduction de Galette.

source: Models rely on HTML and CSS styles, but keep in mind we are building a PDF file, and not displaying a page in a recent brower; there are many limitations.
fr_fr: Les modèles sont basés sur du HTML et des styles CSS, mais gardez à l'esprit que nous construisons un PDF, pas une page pour un navigateur récent ; il y a de nombreuses limitations.

source: Invoices and receipts
fr_fr: Factures et reçus

source: Invoice and receipt models are the same, excepting their titles.
fr_fr: Les modèles de factures et de reçus sont identiques, à l'exception de leurs titres.

source: Invoice PDF model
fr_fr: Modèle PDF facture

source: As you can see in the above screenshot, invoice model does not define any header, footer or CSS styles, the ones form the `Global` model are used.
fr_fr: Comme vous pouvez le voir dans la capture écran ci-dessous, le modèle de facture ne définit pas d'en-tête, pied de page ou style CSS, ceux du modèle `Global` sont utilisés.

source: Membership form
fr_fr: Formulaire d'adhésion

source: It is a model that can be used to print a membership form. It can be empty (to print some of them for any event for example) or filled with one member informations.
fr_fr: C'est un modèle qui peut être utilisé pour imprimer une fiche adhérent. Elle peut être vierge (pour les imprimer pour un évènement par exemple) ou rempli avec les informations d'un adhérent.

source: Since there are many limitation, you may use the :doc:`FullCard plugin </plugins/fullcard>` that will replace this model. It is more complex to change, but you can do many more with it. You can also create your own plugin based on FullCard.
fr_fr: Puisqu'il existe de nombreuses limitations, vous pouvez utiliser le :doc:`plugin FullCard </plugins/fullcard>` qui va remplacer ce modèle. C'est davantage compliqué à modifier, mais vous pourrez en faire plus avec cette solution. Vous pouvez aussi créer votre propre plugin basé sur FullCard.
