Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/recherche.po
Languages: fr_fr, uk

source: Search
fr_fr: Recherche
uk: Пошук

source: Every executed search will be conserved during your session. You can change a parameter or else, and come back to the list, you will find all your previous search parameters.
fr_fr: Chaque recherche effectuée sera conservée le temps de votre session Vous pouvez changer des paramètres ou autre, et revenir à la liste, vous retrouverez vos critères de recherche précédents.
uk: Кожен виконаний пошук буде збережено під час сеансу. Ви можете змінити той чи інший параметр, а повернувшись до списку, ви знайдете всі свої попередні параметри пошуку.

source: Filtering members list
fr_fr: Filtrer la liste des adhérents
uk: Добирання списку членів

source: The form at the top of the members list allow you to make some search among members. The :ref:`advanced search <advsearch>` provides more cireria and possibilities.
fr_fr: Le formulaire en haut de la liste des adhérents vous permet d'effectuer quelques recherches parmi les adhérents. La :ref:`recherche avancée <advsearch>` propose davantage de critères et de possibilités.
uk: Форма у верхній частині списку членів дозволяє зробити певну добірку серед членів. :ref:`розширений пошук <advsearch>` надає більше критеріїв і можливостей.

source: Filter members list
fr_fr: Filtrer la liste des adhérents
uk: Добирання списку членів

source: You can filter on:
fr_fr: Vous pouvez filtrer sur :
uk: Ви можете здійснити добірку:

source: a full text search on one of the following informations:
fr_fr: une recherche textuelle parmi les informations suivantes :
uk: повний текстовий пошук за одними з таких даних:

source: name (first name, last name and nickname),
fr_fr: nom (prénom, nom de famille et pseudo),
uk: ім'я (ім'я, прізвище та позивний),

source: company name,
fr_fr: nom de la compagnie,
uk: назва компанії,

source: address (address, address continuation, zipcode, town and country),
fr_fr: adresse (adresse, suite de l'adresse, code postal, ville et pays),
uk: адреса (адреса, продовження адреси, поштовий індекс, місто та країна),

source: email and instant messaging addresses (email address, website URL, and all direct messenging addresses),
fr_fr: adresses de courriel et de messagerie instantanée (adresse de courriel, URL du site web et toutes les adresses de messagerie instantanée),
uk: адреси е-пошти та інших переписників (е-пошта, URL-адреса вебсайту та всі адреси переписників-месенджерів),

source: job position,
fr_fr: emploi,
uk: посада,

source: informations (public informations and - for administrators only - pivate informations).
fr_fr: informations (informations publiques et - pour les administrateurs uniquement - les informations privées).
uk: відомості (загальнодоступні та лише для адміністраторів - особисті відомості).

source: a member status:
fr_fr: un statut d'adhésion :
uk: стан члена:

source: all members,
fr_fr: tous les adhérents,
uk: усі члени,

source: up to date members,
fr_fr: adhérents à jour,
uk: наявні члени,

source: closes expiries (members whose membership expires in 30 days)
fr_fr: échéances proches (membres dont l'adhésion expire dans les 30 jours)
uk: добіжні члени (чиє членство припиниться через 30 днів)

source: latecomers,
fr_fr: retardataires,
uk: запізнілі,

source: members whose never had a membership,
fr_fr: adhérents qui n'ont jamais cotisé,
uk: члени, які ніколи не мали членства,

source: staff members,
fr_fr: membres du bureau,
uk: співробітники,

source: administrators.
fr_fr: administrateurs.
uk: адміністратори.

source: a status of the account:
fr_fr: un statut de compte :
uk: за станом облікового запису:

source: all accounts,
fr_fr: tous les comptes,
uk: усі облікові записи,

source: active accounts,
fr_fr: comptes actifs,
uk: діяльні облікові записи

source: inactive accounts.
fr_fr: comptes inactifs.
uk: бездіяльні облікові записи.

source: group affiliation,
fr_fr: affiliation à un groupe,
uk: приналежність до групи,

source: presence or absence of an email address.
fr_fr: présence ou absence d'une adresse de courriel.
uk: наявність або відсутність адреси е-пошти.

source: All filters can be combined, giving you the ability to search among your active members whose have an email address and whose name contains a "a" ;)
fr_fr: Tous les filtres peuvent être combinés, vous donnant la possibilité de rechercher les adhérents actifs ayant une adresse de courriel et dont le nom contient un « a »;)
uk: Всі добірки можна сполучувати, що дає вам можливість шукати наприклад серед діяльних учасників, у яких є адреса е-пошти та ім'я яких містить "a";)

source: Advanced search
fr_fr: Recherche avancée
uk: Розширений пошук

source: Advanced search can be found in the main menu and propose an certain amount of fields types, related to members or their membership. The screen is separated into four parts (you can reduce individually):
fr_fr: La recherche avancée se trouve dans le menu principal et vous propose un certain nombre de champs, relatifs aux adhérents et leurs adhésions. Cet écran est séparé en quatre parties (que vous pouvez réduire individuellement) :
uk: Розширений пошук можна знайти в головному меню. Він пропонує певну кількість типів полів, пов'язаних з членами або їх членством. Екран розділений на чотири частини (можна зменшити окремо):

source: **simple search** which recall all filters present in the members list,
fr_fr: **recherche simple** qui reprend les critères de recherche présents dans la listes des adhérents,
uk: **простий пошук**, який запам'ятовує всі добірки, присутні в списку учасників,

source: **advanced search** which proposes extra fields on members that can be of use,
fr_fr: **recherche avancée** qui propose des champs additionnels sur les adhérents qui peuvent être utiles,
uk: **розширений пошук**, який пропонує додаткові поля для учасників, що можуть бути корисними,

source: **search in contributions** allowing search on members contributions,
fr_fr: **recherche dans les contributions** qui permet de chercher parmi les contributions des adhérents,
uk: **пошук у внесках**, що дозволяє шукати внески членів,

source: **free search** which allow to select any member field possible, including dynamic fields, and which will automatically adapt to selected field. You can add and remove lines to refine search.
fr_fr: **recherche libre** qui permet de sélectionner tous les champs des adhérents, y compris les champs dynamiques, et qui s'adaptera automatiquement au champ sélectionné. Vous pouvez ajouter ou supprimer des lignes pour affiner la recherche.
uk: **вільний пошук**, що дозволяє вибрати будь-яке можливе поле-члена, включаючи динамічні поля, і який автоматично пристосовується до вибраного поля. Ви можете додавати та видаляти рядки, щоб уточнити пошук.

source: Saved searches
fr_fr: Recherches enregistrées
uk: Збережені пошукові запити

source: Every search on members can be stored (with a name) in order to be executed again later. They are accessible only for their author.
fr_fr: Toute recherche sur les adhérents peut être enregistrée (avec un nom) pour être exécutée à nouveau par la suite. Elles ne sont accessibles que par leur propre auteur.
uk: Кожен пошук по членах може бути збережений (з ім'ям) для повторного виконання пізніше. Вони доступні тільки для їх автора.

source: After you proceed a search ("simple" or "advanced"), just click on the "Save" button, and pick up a name.
fr_fr: Après avoir effectué une recherche ("simple" ou "avancée"), cliquez juste sur le bouton « Enregistrer » et choisissez un nom.
uk: Після того, як ви продовжите пошук («простий» або «розширений»), просто натисніть кнопку «Зберегти» та виберіть ім’я.

source: Save a search
fr_fr: Enregistrer une recherche
uk: Зберегти пошуковий запит

source: You can find saved searches in the list:
fr_fr: Vous pouvez trouver les recherches sauvegardées dans la liste :
uk: Збережені пошукові запити можна знайти у списку:

source: Searches list
fr_fr: Liste des recherches
uk: Список пошуків

source: From this list, you will be able to remove or execute again searches, and also see a detail of used criteria.
fr_fr: Depuis cette liste, vous serez en mesure de supprimer ou d'exécuter à nouveau une recherche enregistrée, et aussi de voir les détail des critères utilisés.
uk: З цього списку ви зможете видалити або повторно виконати пошук, а також побачити подробиці використаних критеріїв.
