Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/galette.po
Languages: fr_fr

source: Galette installation is a web based process (once :doc:`preparation steps <preparation>` are done). Go to http://localhost/galette. :doc:`Update process <update>` is documented separately.
fr_fr: L'installation de Galette est un processus web (une fois les :doc:`étapes de préparation <preparation>` effectuées). Rendez-vous sur http://localhost/galette. Le :doc:`processus de mise à jour <update>` est documenté séparément.

source: You should rely on latest stable release, but it is also possible (if your know what you are doing, this is more complex for non developers!) grab it from :doc:`source code <../source_code>`
fr_fr: Vous devriez vous baser sur la dernière release stable, mais il est aussi possible (si vous savez ce que vous faites, cela peut s'avérer plus complexe pour les non développeurs !) de récupérer le :doc:`code source <../source_code>`

source: Checks
fr_fr: Vérifications

source: Please check the following if you want Galette to install without problems:
fr_fr: Vérifiez les points suivants pour que Galette tourne sans problèmes :

source: your PHP version is high enough,
fr_fr: votre version de PHP est suffisamment récente,

source: PHP timezone is set (required since PHP 5.3),
fr_fr: le fuseau horaire PHP est défini (requis depuis PHP 5.3),

source: all required PHP extensions are installed and loaded,
fr_fr: toutes les extensions requises sont installées et actives,

source: some directories requires write access.
fr_fr: certains dossiers demandent un accès en écriture.

source: If one of the mandatory extensions is missing or if the timezone is not set, please ask you system administrator. Galette does not require any "exotic" extension.
fr_fr: Si une des extensions requises est manquante ou si le fuseau horaire n'est pas défini, veuillez contacter votre administrateur. Galette ne requiert aucune extension « exotique ».

source: The very first installation step will check those points, and will warn you if something gets wrong.
fr_fr: La toute première étape de l'installation vérifiera ces points, et vous informera des éventuels problèmes.

source: If all :ref:`the installation steps <preparation>` has been properly followed, directories ACLs should be correct, please refer to :ref:`files ACLs section <droitsfichiers>` and refresh page in your browser.
fr_fr: Si toutes :ref:`les étapes de préparation <preparation>` ont été suivies correctement, les droits devraient être bons, veuillez vous référer à la :ref:`section relative aux droits des fichiers <droitsfichiers>` et rafraichissez la page dans votre navigateur.

source: Installation type
fr_fr: Type d'installation

source: Next screen ask you for installation type. You'll choose beetween "New installation" or "Update". Several of the steps that will follow will be specific to the type you will choose here.
fr_fr: L'écran suivant vous demande le type d'installation. Vous choisirez entre « Nouvelle installation » et « Mise à jour ». Plusieurs des étapes qui vont suivre seront spécifiques aux choix effectué ici.

source: Database
fr_fr: Base de données

source: First of all, make sure the database exists, and prepare all required information:
fr_fr: Tout d'abord, assurez vous que la base existe, et préparez toutes les informations nécessaires :

source: host name
fr_fr: nom de l'hôte

source: database user name
fr_fr: nom d'utilisateur de la base de données

source: database user password
fr_fr: mot de la passe de l'utilisateur de la base de données

source: database name
fr_fr: nom de la base de données

source: database type (MariaDB/MySQL or PostgreSQL)
fr_fr: type de base de données (MariaDB/MySQL ou PostgreSQL)

source: Create database
fr_fr: Créer la base de données

source: **Never use database root user!**
fr_fr: **N'utilisez jamais l'utilisateur root !**

source: For security reasons, it is stongly advised to rely on a specific user for Galette database, and give him only requested access on the single Galette database.
fr_fr: Pour des raisons de sécurité, il est fortement conseillé d'utiliser un utilisateur spécifique à la base de données de Galette, et de ne lui donner que les droits requis sur la base de données de Galette.

source: For the example, we will use a database named `mygalette` with a user `mygaletteuser` with `mypass` as password.
fr_fr: Par exemple, nous utiliserons une base de données nommée `mygalette` avec un utilisateur `mygaletteuser` ayant pour mot de passe `mypass`.

source: Those commands may vary, please refer to `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ or `PostgreSQL <https://docs.postgresqlfr.org>`_ documentations, or use a graphical tool:
fr_fr: Ces commandes peuvent varier, reportez-vous aux documentation `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ ou `PostgreSQL <https://docs.postgresqlfr.org>`_, ou utilisez un outil graphique :

source: `phpMyAdmin <https://www.phpmyadmin.net>`_ for MariaDB ;
fr_fr: `phpMyAdmin <https://www.phpmyadmin.net>`_ pour MariaDB ;

source: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ or `PgAdmin <https://www.pgadmin.org/download/?lang=fr_FR>`_ for PostgreSQL.
fr_fr: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ ou `PgAdmin <https://www.pgadmin.org/download/?lang=fr_FR>`_ pour PostgreSQL.

source: Database parameters
fr_fr: Paramètres de base de données

source: On that screen, select your database type, and enter hostname, database name, user name and password. Tables prefix is usefull if you do not have a Galette dedicated database, default proposal should be ok but you can choose what you want :)
fr_fr: Sur cet écran, choisissez le type de base de données, entrez un nom d'hôte, un utilisateur et un mot de passe. Le préfixe des tables est utile si votre base de données n'est pas dédiée à Galette, les propositions par défaut devraient convenir, mais vous pouvez les changer :)

source: This step is the same for installation and update processes. If a configuration file already exists, Galette will grab the information to pre fill the form (not for the password). When upgrading, double check the prefix fit the existing one.
fr_fr: Cette étape est identique à l'installation et à la mise à jour. Si un fichier de configuration existe, Galette va y récupérer les informations pour pré-remplir le formulaire (sauf pour le mot de passe). Lors d'une mise à jour, assurez-vous bien que le préfixe correspond bien à celui qui existe.

source: Next screen will try to connect to the database using provided elements, than it will check database rights are correct (user can add/remove/alter tables, and can add/remove/edit rows, ...).
fr_fr: L'écran suivant essaiera de se connecter à la base de données avec les éléments founis, et vérifiera ensuite que les droits d'accès sont corrects (l'utilisateur peut ajouter/supprimer/modifier de tables et peut ajouter/supprimer/modifier des lignes).

source: If there is a connexion error, go back to previous step, fix your setup and try again. If you see rights issues, get them fixed on your server and use the "Refresh" button.
fr_fr: S'il y a une erreur de connexion, retournez à la page précédente, corrigez votre configuration, et essayez de nouveau. Si vous voyez des problèmes de droits, corrigez les sur votre serveur et utilisez le bouton « Rafraichir ».

source: Create tables
fr_fr: Création des tables

source: Those instructions are only for installation. When updating, a database already exists.
fr_fr: Ces instructions ne sont valables que pour une nouvelle installation Lors d'une mise à jour, la base de données existe déjà.

source: If a connection can be established to the database, and all is correct; installer will now create the tables, and insert default values. You can show created tables from any graphical tool or in command line:
fr_fr: Si une connexion à la base de données à pu être établie, et que tout est correct, le système d'installation va maintenant créer les tables et insérer les valeurs par défaut. Vous pouvez voir les tables créées depuis n'importe quel outil graphique ou en ligne de commande :

source: Admin parameters
fr_fr: Paramètres administrateur

source: This screen is displayed from installation only. When updating, super admin user is already existing.
fr_fr: Cet écran est affiché à l'installation uniquement. Lors d'une mise à jour, le super administrateur existe déjà.

source: Next screen will ask you for information to create the Galette super admin user. Using Galette, you can set some members as administrators, but the one created at installation time is not a member, cannot be removed, and has some extra rights.
fr_fr: L'écran suivant vous demandera les information de l'utilisateur super administrateur de Galette. À l'utilisation, vous pouvez définir certains adhérents de Galette comme administrateurs, mais celui créé à l'installation n'est pas un membre, ne peut être supprimé, et possède des droits que n'ont aucun des autres.

source: Initialize
fr_fr: Initialiser

source: The last step will write the configuration file if needed, and initialyse some values in your fresh database, as exemple:
fr_fr: La dernière étape écrit le fichier de configuration au besoin, et initialise des valeurs par défaut dans votre base, par exemple :

source: add Galette default preferences
fr_fr: ajout des préférences par défaut de Galette

source: add default contributions and status types,
fr_fr: ajout des types de contributions et des status pa défaut,

source: fields configuration and permissions,
fr_fr: configuration des champs et permissions,

source: texts for administrative emails,
fr_fr: textes pour les courriels administratifs,

source: members default titles,
fr_fr: statuts des adhérents par défaut,

source: default PDF models
fr_fr: modèles PDF par défaut

source: When updating, only the missing preferences and the new default data if any will be handled.
fr_fr: Lors d'une mise à jour, seules les préférences manquantes et les nouvelles données seront prises en charge.

source: Installation end
fr_fr: Fin de l'installation

source: Installation is now finished, congratulations!
fr_fr: L'installation est terminée, félicitations !

source: You can now login to Galette, using super admin information you used at installation time. You can now go to the :doc:`Galette user manual <../usermanual/index>`.
fr_fr: Vous pouvez maintenant vous connecter à Galette, en utilisant les identifiants super administrateur renseignés à l'installation. Rendez-vous maintenant au :doc:`manuel de l'utilisateur de Galette <../usermanual/index>`.

source: Happy Galette!
fr_fr: Bonne Galette !
