Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/postinstall.po
Languages: es

source: Post installation
es: Posterior a la instalación

source: Various tasks
es: Diversas tareas

source: remove write access to the ``config`` directory.
es: eliminar el acceso de escritura al directorio ``config``.

source: Configure paths
es: Configurar rutas

source: Some galette paths may be changed from a configuration parameter, such as exports, photos, etc
es: Algunas rutas de galette se pueden cambiar desde un parámetro de configuración, como exportaciones, fotos, etc

source: By default, Galette provides all those directories inside installation directory. That way, if installation is located at ``/var/www/galette``, exports will be in ``/var/www/galette/data/exports``, photos in ``/var/www/galette/data/photos/``, and so on. Default configuration is done in ``config/paths.inc.php`` file that should not be changed.
es: Por defecto, Galette proporciona todos esos directorios dentro del directorio de instalación. Así, si la instalación se encuentra en ``/var/www/galette``, las exportaciones estarán en ``/var/www/galette/data/exports``, las fotos en ``/var/www/galette/data/photos/``, y así sucesivamente. La configuración por defecto se realiza en el archivo ``config/paths.inc.php`` que no debe ser modificado.

source: Instead, you may override some or all of the values in a ``config/local_paths.inc.php``, with paths you want declared as PHP constants. For exemple, to define a different path for photos:
es: En su lugar, puede anular algunos o todos los valores en ``config/local_paths.inc.php``, con las rutas que desea declarar como constantes de PHP. Por ejemplo, para definir una ruta diferente para las fotos:

source: All paths that originally resides in ``data`` directory must stay accessible read/write for the web server. All other directories should be set as read only, the web server should not have to write in them. Here is the complete list:
es: Todas las rutas que residen originalmente en el directorio ``datos`` deben permanecer accesibles para lectura/escritura para el servidor web. Todos los demás directorios deben configurarse como de solo lectura, el servidor web no debería tener que escribir en ellos. Aquí está la lista completa:

source: `GALETTE_CONFIG_PATH` : path to Galette configuration files,
es: `GALETTE_CONFIG_PATH`: ruta a los archivos de configuración de Galette,

source: `GALETTE_DATA_PATH` : path to Galette data directory (since 0.8),
es: `GALETTE_DATA_PATH`: ruta al directorio de datos de Galette (desde 0.8),`GALETTE_DATA_PATH`: ruta al directorio de datos de Galette (desde 0.8),

source: `GALETTE_LOGS_PATH` : Galette logs path, change it as you want,
es: `GALETTE_LOGS_PATH`: ruta de registro de Galette, cámbiela como desee,

source: `GALETTE_COMPILE_DIR` : path for Smarty templating system compilation,
es: `GALETTE_COMPILE_DIR`: ruta para la compilación del sistema de plantillas Smarty,

source: `GALETTE_CACHE_DIR` : caching directory for a few cases,
es: `GALETTE_CACHE_DIR`: directorio de almacenamiento en caché para algunos casos,

source: `GALETTE_EXPORTS_PATH` : path to the directory to store CSV exports,
es: `GALETTE_EXPORTS_PATH`: ruta al directorio para almacenar exportaciones CSV,

source: `GALETTE_IMPORTS_PATH` : path to the directory that contains CSV files to import,
es: `GALETTE_IMPORTS_PATH`: ruta al directorio que contiene los archivos CSV para importar,

source: `GALETTE_ATTACHMENTS_PATH` : path to attached documents in mailing,
es: `GALETTE_ATTACHMENTS_PATH`: ruta a los documentos adjuntos en el correo,

source: `GALETTE_FILES_PATH` : path to the dynamic files directory storage (from dynamic fields),
es: `GALETTE_FILES_PATH`: ruta al almacenamiento del directorio de archivos dinámicos (desde campos dinámicos),

source: `GALETTE_PHOTOS_PATH` : path to store members photos and logos.
es: `GALETTE_PHOTOS_PATH`: ruta para almacenar fotos y logotipos de los miembros.

source: Data security
es: Seguridad de los datos

source: You and your members will login to Galette, using a login and a password. You must be aware that those information are transmitted as is to the server; and someone may intercept and read them sniffing your exchanges.
es: Usted y sus miembros iniciarán sesión en Galette, utilizando un nombre de usuario y una contraseña. Debe tener en cuenta que esa información se transmite tal cual al servidor; y alguien puede interceptarlos y leerlos olfateando sus intercambios.

source: This problem is recurrent hen you have to send data over the internet, and this is why you must check if you are on a HTTPS secured page (your browser will tell you), when you enter any sensitive information such as login, passwords, credit card number, ...
es: Este problema es recurrente cuando tienes que enviar datos a través de Internet, y es por eso que debes verificar si estás en una página segura HTTPS (tu navegador te lo dirá), cuando ingresas cualquier información confidencial, como nombre de usuario, contraseñas, crédito. número de tarjeta, ...

source: And this is the same for Galette, you can use it walong with SSL, no problem. All data that will be transmitted to the server will be a bit more confident and secured :)
es: Y esto es lo mismo para Galette, puedes usarlo junto con SSL, no hay problema. Todos los datos que se transmitirán al servidor serán un poco más seguros y seguros :)
