Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/prerequis.po
Languages: es

source: Prerequisites and hosting
es: Requisitos previos y alojamiento

source: To install Galette, you will need to meet the following requirements :
es: Para instalar Galette, deberá cumplir con los siguientes requisitos:

source: a web server (like Apache),
es: un servidor web (como Apache),

source: PHP 7.2 or more recent,
es: PHP 7.2 o más reciente,

source: `gd` PHP module,
es: el módulo PHP`gd`,

source: `PDO` module and `mysql` ou `postgresql` for PDO,
es: Módul0`PDO` y` mysql` ou`postgresql` para PDO,

source: `curl` PHP module,
es: módulo PHP`curl`,

source: `intl` PHP module,
es: módulo PHP`intl`,

source: SSL support,
es: Soporte SSL,

source: `tidy` PHP module (optional, but recommended),
es: módulo PHP `tidy`(opcional, pero recomendado),

source: `gettext` PHP module (optional).
es: Módulo PHP `gettext`(opcional).

source: A database server, `MariaDB <https://mariadb.org>`_ (or MySQL) 5.5 minimum, or `PostgreSQL <https://postgresql.org>`_ 9.1 minimum.
es: Un servidor de base de datos, `MariaDB https: //mariadb.org`_(o MySQL) 5.5 mínimo, o`PostgreSQL https: //postgresql.org`_9.1 mínimo.

source: Galette is tested continuously with recent versions of these components. If you encounter issues with a recent version, please let us know ;)
es: Galette se prueba continuamente con versiones recientes de estos componentes. Si tiene problemas con una versión reciente, háganoslo saber;)

source: Galette does not work on the following hostings:
es: Galette no funciona en los siguientes alojamientos:

source: Free,
es: Gratis
