Repository: gagnieray/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/update.po
Languages: uk

source: Updating
uk: Оновлення

source: If you are using an old Galette release, it's time to update.
uk: Якщо ви використовуєте старий випуск Galette, настав час оновитися.

source: An update is often not something lite, your data may be modified. So, please make sure you made **a backup of your current database**, or you may lost all or a part of your data.
uk: Оновлення часто не є простим, ваші дані можуть бути змінені. Отже, переконайтесь, що ви зробили **резервну копію поточної бази даних**, інакше ви можете втратити всі або частину своїх даних.

source: A backup of all Galette files is also recommended it would be helpfull if you find a bug that prevent you to migrate and have to restore an old version;
uk: Також пораджено зробити резервну копію всіх файлів Galette. Це було б корисно, якщо ви виявите помилку, яка перешкоджатиме переходу, і вам потрібно буде відновити стару версію;

source: Migrating a pre 0.7 release is theorically supported, but this is not tested (those releases are more than 10 years old!), and it is possible your attempt fail.
uk: Перехід з попереднього випуску 0.7 підтримується теоретично, але це не перевірено (цим випускам понад 10 років!), і можливо, ваша спроба зазнає невдачі.

source: Nothing is really made to make such a time travel ;) If this is your case, you should first `migrate to Galette 0.7.8 <https://download.tuxfamily.org/galette/archives/galette-0.7.8.tar.bz2>`_; and do another migration to the latest version.
uk: Насправді немає жодних шансів, що вам доведеться зробити таку подорож у часі ;). Але якщо це ваш випадок, вам слід спочатку `перейти до Galette 0.7.8 <https://download.tuxfamily.org/galette/archives/galette-0.7.8.tar.bz2>`_; і зробіть інший перехід до останньої версії.

source: Updating files
uk: Оновлення файлів

source: First, logout from your instance, and make sure to use a maintenance mode to prevent other users to reach the instance.
uk: Спочатку вийдіть зі свого зразка та переконайтеся, що використовуєте режим обслуговування, щоб інші користувачі не могли отримати доступ до зразка.

source: Then, download latest Galette version and replace the files. For more information on files installation, refer to the :ref:`prepare installation <preparation>` section.
uk: Потім завантажте останню версію Galette і замініть файли. Для отримання докладніших відомостей про встановлення файлів див. розділ :ref:`підготування до встановлення <preparation>`.

source: Some directories keep data and/or configurations and should be copied back to the new instance:
uk: Деякі каталоги зберігають дані та/або конфігурації та повинні бути скопійовані назад у новий зразок:

source: ``config/config.inc.php``. If this file is missing, Galette update process will ask you the information and create a new one. If the file is present, it will be used to fill information excepted database password. It is the only file that can be edited during update process,
uk: ``config/config.inc.php``. Якщо цього файлу немає, процес оновлення Galette запросить відомості та створить новий. Якщо файл наявний, він буде використовуватися для заповнення відомостей, за винятком пароля бази даних. Це єдиний файл, який можна редагувати в процесі оновлення,

source: ``data/photos`` your members photos and logos,
uk: ``data/photos`` світлини та логотипи ваших членів,

source: ``data/exports`` contains CSv exports,
uk: ``data/exports`` містить експорти CSV,

source: ``data/files`` contains files from dynamic fields of type file,
uk: ``data/files`` містить файли з динамічних полів типу файлу,

source: ``data/attachments`` contains mailing attached documents.
uk: ``data/attachments`` містить поштові документи.

source: ``plugins`` your current plugins. It is a good idea to check if new plugins versions are available ;)
uk: ``plugins`` ваші поточні розширення. Непогано буде перевірити, чи доступні нові версії розширень ;)

source: Once files are updated, go to your Galette instance. It will ask you if needed to proceed to the update of your database.
uk: Коли файли будуть оновлені, зайдіть у свій зразок Galette. Він запитає вас, чи потрібно перейти до оновлення бази даних.

source: If so, visit the install URL ``/installer.php`` (ex: https://your.domain.name/installer.php) and choose *Update* when your are asked for the type of installation.
uk: Якщо так, перейдіть за адресою встановлення ``/installer.php`` (наприклад: https://your.domain.name/installer.php) і виберіть *Оновити*, коли вас запитають про вид установлення.

source: If it asks you nothing you're just done already ;)
uk: Якщо він не запитує вас нічого, ви тільки що все вже зробили ;)

source: Updating database
uk: Оновлення бази даних

source: Installing a new Galette release does not strictly means a database update will be required! Sometimes, only updating the files will be enough; even for a major release.
uk: Установлення нового випуску Galette не означає, що потрібне оновлення бази даних! Іноді досить оновити тільки файли, навіть для великого випуску.

source: Galette will tell you if an update is needed, no need to "force" an update.
uk: Galette скаже вам, чи потрібне оновлення, не потрібно "примусово" оновлюватись.

source: Update process is very similar to :doc:`Galette installation process <galette>`, with some steps that change. All is motly transparent, information are provided on each step.
uk: Процес оновлення дуже схожий на :doc:`процес установлення Galette <galette>`, з деякими відмінними кроками. Усе дуже прозоро, щодо кожного кроку надаються відомості.

source: Database information
uk: Відомості про базу даних

source: At "Installation type" step, you'll have to choose "update". Database information page will be pre filled with existing information, excepting password. Other information should not be changed.
uk: На кроці "Тип установлення" потрібно вибрати "Оновлення". Сторінку відомостей про базу даних буде заповнено наявними відомостями, за винятком пароля. Інші відомості змінювати не слід.

source: Note it is important that database name and prefixed used in previous database correspond to configuration.
uk: Запримітьте, важливо, щоб назва бази даних та префікс, які використовувались у попередній базі даних, відповідали конфігурації.

source: Previous version selection
uk: Вибір попередньої версії

source: Next step is the choice of the previous Galette version. Installation process will try to "guess" what version it as, and will select this one per default (the one that will be displayed as bold text).
uk: Наступний крок - вибір попередньої версії Galette. Процес установлення спробує "вгадати", яка це версія, і вибере її типову (та, яка буде відображатися жирним текстом).

source: If you try to update but your database version seems already correct, you will be warned. No entry will be displayed as bold text, please make sure to choose the right one:
uk: Якщо ви спробуєте оновитися, але версія вашої бази даних здається вже правильною, ви отримаєте попередження. Жоден запис не відображатиметься жирним шрифтом, будь ласка, переконайтеся, що обираєте правильний:

source: Once update scripts have run, a summary will be displayed.
uk: Після запуску сценаріїв оновлення відобразиться підсумок.
